RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
        uint32_t adc_reserved4;

        union {
            uint32_t R;
            struct {
                uint32_t CH31:1;
                uint32_t CH30:1;
                uint32_t CH29:1;
                uint32_t CH28:1;
                uint32_t CH27:1;
                uint32_t CH26:1;
                uint32_t CH25:1;
                uint32_t CH24:1;
                uint32_t CH23:1;
                uint32_t CH22:1;
                uint32_t CH21:1;
                uint32_t CH20:1;
                uint32_t CH19:1;
                uint32_t CH18:1;
                uint32_t CH17:1;
                uint32_t CH16:1;
                uint32_t CH15:1;
                uint32_t CH14:1;
                uint32_t CH13:1;
                uint32_t CH12:1;
                uint32_t CH11:1;
                uint32_t CH10:1;
                uint32_t CH9:1;
                uint32_t CH8:1;
                uint32_t CH7:1;
                uint32_t CH6:1;
                uint32_t CH5:1;
                uint32_t CH4:1;
                uint32_t CH3:1;
                uint32_t CH2:1;
                uint32_t CH1:1;
                uint32_t CH0:1;
            } B;
        } NCMR0;                /* NORMAL CONVERSION MASK REGISTER 0 */

        union {
            uint32_t R;
            struct {
                uint32_t CH63:1;
                uint32_t CH62:1;
                uint32_t CH61:1;
                uint32_t CH60:1;
                uint32_t CH59:1;
                uint32_t CH58:1;
                uint32_t CH57:1;
                uint32_t CH56:1;
                uint32_t CH55:1;
                uint32_t CH54:1;
                uint32_t CH53:1;
                uint32_t CH52:1;
                uint32_t CH51:1;
                uint32_t CH50:1;
                uint32_t CH49:1;
                uint32_t CH48:1;
                uint32_t CH47:1;
                uint32_t CH46:1;
                uint32_t CH45:1;
                uint32_t CH44:1;
                uint32_t CH43:1;
                uint32_t CH42:1;
                uint32_t CH41:1;
                uint32_t CH40:1;
                uint32_t CH39:1;
                uint32_t CH38:1;
                uint32_t CH37:1;
                uint32_t CH36:1;
                uint32_t CH35:1;
                uint32_t CH34:1;
                uint32_t CH33:1;
                uint32_t CH32:1;
            } B;
        } NCMR1;                /* NORMAL CONVERSION MASK REGISTER 1 */

        union {
            uint32_t R;
            struct {
                uint32_t PSR95:1;
                uint32_t PSR94:1;
                uint32_t PSR93:1;
                uint32_t PSR92:1;
                uint32_t PSR91:1;
                uint32_t PSR90:1;
                uint32_t PSR89:1;
                uint32_t PSR88:1;
                uint32_t PSR87:1;
                uint32_t PSR86:1;
                uint32_t PSR85:1;
                uint32_t PSR84:1;
                uint32_t PSR83:1;
                uint32_t PSR82:1;
                uint32_t PSR81:1;
                uint32_t PSR80:1;
                uint32_t PSR79:1;
                uint32_t PSR78:1;
                uint32_t PSR77:1;
                uint32_t PSR76:1;
                uint32_t PSR75:1;
                uint32_t PSR74:1;
                uint32_t PSR73:1;
                uint32_t PSR72:1;
                uint32_t PSR71:1;
                uint32_t PSR70:1;
                uint32_t PSR69:1;
                uint32_t PSR68:1;
                uint32_t PSR67:1;
                uint32_t PSR66:1;
                uint32_t PSR65:1;
                uint32_t PSR64:1;
            } B;
        } NCMR2;                /* NORMAL CONVERSION MASK REGISTER 2 */

        uint32_t adc_reserved5;

        union {
            uint32_t R;
            struct {
                uint32_t CH31:1;
                uint32_t CH30:1;
                uint32_t CH29:1;
                uint32_t CH28:1;
                uint32_t CH27:1;
                uint32_t CH26:1;
                uint32_t CH25:1;
                uint32_t CH24:1;
                uint32_t CH23:1;
                uint32_t CH22:1;
                uint32_t CH21:1;
                uint32_t CH20:1;
                uint32_t CH19:1;
                uint32_t CH18:1;
                uint32_t CH17:1;
                uint32_t CH16:1;
                uint32_t CH15:1;
                uint32_t CH14:1;
                uint32_t CH13:1;
                uint32_t CH12:1;
                uint32_t CH11:1;
                uint32_t CH10:1;
                uint32_t CH9:1;
                uint32_t CH8:1;
                uint32_t CH7:1;
                uint32_t CH6:1;
                uint32_t CH5:1;
                uint32_t CH4:1;
                uint32_t CH3:1;
                uint32_t CH2:1;
                uint32_t CH1:1;
                uint32_t CH0:1;
            } B;
        } JCMR0;                /* INJECTED CONVERSION MASK REGISTER 0 */

        union {
            uint32_t R;
            struct {
                uint32_t CH63:1;
                uint32_t CH62:1;
                uint32_t CH61:1;
                uint32_t CH60:1;
                uint32_t CH59:1;
                uint32_t CH58:1;
                uint32_t CH57:1;
                uint32_t CH56:1;
                uint32_t CH55:1;
                uint32_t CH54:1;
                uint32_t CH53:1;
                uint32_t CH52:1;
                uint32_t CH51:1;
                uint32_t CH50:1;
                uint32_t CH49:1;
                uint32_t CH48:1;
                uint32_t CH47:1;
                uint32_t CH46:1;
                uint32_t CH45:1;
                uint32_t CH44:1;
                uint32_t CH43:1;
                uint32_t CH42:1;
                uint32_t CH41:1;
                uint32_t CH40:1;
                uint32_t CH39:1;
                uint32_t CH38:1;
                uint32_t CH37:1;
                uint32_t CH36:1;
                uint32_t CH35:1;
                uint32_t CH34:1;
                uint32_t CH33:1;
                uint32_t CH32:1;
            } B;
        } JCMR1;                /* INJECTED CONVERSION MASK REGISTER 1 */

        union {
            uint32_t R;
            struct {
                uint32_t PSR95:1;
                uint32_t PSR94:1;
                uint32_t PSR93:1;
                uint32_t PSR92:1;
                uint32_t PSR91:1;
                uint32_t PSR90:1;
                uint32_t PSR89:1;
                uint32_t PSR88:1;
                uint32_t PSR87:1;
                uint32_t PSR86:1;
                uint32_t PSR85:1;
                uint32_t PSR84:1;
                uint32_t PSR83:1;
                uint32_t PSR82:1;
                uint32_t PSR81:1;
                uint32_t PSR80:1;
                uint32_t PSR79:1;
                uint32_t PSR78:1;
                uint32_t PSR77:1;
                uint32_t PSR76:1;
                uint32_t PSR75:1;
                uint32_t PSR74:1;
                uint32_t PSR73:1;
                uint32_t PSR72:1;
                uint32_t PSR71:1;
                uint32_t PSR70:1;
                uint32_t PSR69:1;
                uint32_t PSR68:1;
                uint32_t PSR67:1;
                uint32_t PSR66:1;
                uint32_t PSR65:1;
                uint32_t PSR64:1;
            } B;
        } JCMR2;                /* INJECTED CONVERSION MASK REGISTER 2 */

        union {
            uint32_t R;
            struct {
                uint32_t:15;
                uint32_t OFFSETLOAD:1;
                  uint32_t:8;
                uint32_t OFFSET_WORD:8;
            } B;
        } OFFWR;                /* OFFSET WORD REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t:24;
                uint32_t DSD:8;
            } B;
        } DSDR;                 /* DECODE SIGNALS DELAY REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t:24;
                uint32_t PDED:8;
            } B;
        } PDEDR;                /* DECODE SIGNALS DELAY REGISTER */

        uint32_t adc_reserved6[9];

        union {
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t TEST_CTL:16;
            } B;
        } TCTLR;                /* TEST CONTROL REGISTER */

