RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
        uint32_t adc_reserved7[3];

        union {
            uint32_t R;
            struct {
                uint32_t:12;
                uint32_t VALID:1;
                uint32_t OVERW:1;
                uint32_t RESULT:2;
                  uint32_t:6;
                uint32_t CDATA:10;
            } B;
        } PRECDATAREG[32];      /* PRESISION DATA REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t:12;
                uint32_t VALID:1;
                uint32_t OVERW:1;
                uint32_t RESULT:2;
                  uint32_t:6;
                uint32_t CDATA:10;
            } B;
        } INTDATAREG[32];       /* PRESISION DATA REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t:12;
                uint32_t VALID:1;
                uint32_t OVERW:1;
                uint32_t RESULT:2;
                  uint32_t:6;
                uint32_t CDATA:10;
            } B;
        } EXTDATAREG[32];       /* PRESISION DATA REGISTER */

    };                          /* end of ADC_tag */
/**************************************************************************/
/*                  MODULE : AXBS Crossbar Switch (XBAR)                  */
/**************************************************************************/
    struct XBAR_tag {

        union {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3;
                  uint32_t:1;
                uint32_t MSTR6:3;
                  uint32_t:9;
                uint32_t MSTR5:3;
                  uint32_t:1;
                uint32_t MSTR3:3;
                  uint32_t:1;
                uint32_t MSTR2:3;
                  uint32_t:1;
                uint32_t MSTR1:3;
                  uint32_t:1;
                uint32_t MSTR0:1;
            } B;
        } MPR0;                 /* Master Priority Register 0 */

        uint32_t xbar_reserved1[3];

        union {
            uint32_t R;
            struct {
                uint32_t R0:1;
                  uint32_t:21;
                uint32_t ARB:2;
                  uint32_t:2;
                uint32_t PCTL:2;
                  uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR0;               /* Master Priority Register 0 */

        uint32_t xbar_reserved2[58];

        union {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3;
                  uint32_t:1;
                uint32_t MSTR6:3;
                  uint32_t:9;
                uint32_t MSTR5:3;
                  uint32_t:1;
                uint32_t MSTR3:3;
                  uint32_t:1;
                uint32_t MSTR2:3;
                  uint32_t:1;
                uint32_t MSTR1:3;
                  uint32_t:1;
                uint32_t MSTR0:1;
            } B;
        } MPR1;                 /* Master Priority Register 1 */

        uint32_t xbar_reserved3[3];

        union {
            uint32_t R;
            struct {
                uint32_t R0:1;
                  uint32_t:21;
                uint32_t ARB:2;
                  uint32_t:2;
                uint32_t PCTL:2;
                  uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR1;               /* Master Priority Register 1 */

        uint32_t xbar_reserved4[58];

        union {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3;
                  uint32_t:1;
                uint32_t MSTR6:3;
                  uint32_t:9;
                uint32_t MSTR5:3;
                  uint32_t:1;
                uint32_t MSTR3:3;
                  uint32_t:1;
                uint32_t MSTR2:3;
                  uint32_t:1;
                uint32_t MSTR1:3;
                  uint32_t:1;
                uint32_t MSTR0:1;
            } B;
        } MPR2;                 /* Master Priority Register 2 */

        uint32_t xbar_reserved5[3];

        union {
            uint32_t R;
            struct {
                uint32_t R0:1;
                  uint32_t:21;
                uint32_t ARB:2;
                  uint32_t:2;
                uint32_t PCTL:2;
                  uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR2;               /* Master Priority Register 2 */

        uint32_t xbar_reserved6[58];

        union {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3;
                  uint32_t:1;
                uint32_t MSTR6:3;
                  uint32_t:9;
                uint32_t MSTR5:3;
                  uint32_t:1;
                uint32_t MSTR3:3;
                  uint32_t:1;
                uint32_t MSTR2:3;
                  uint32_t:1;
                uint32_t MSTR1:3;
                  uint32_t:1;
                uint32_t MSTR0:1;
            } B;
        } MPR3;                 /* Master Priority Register 3 */

        uint32_t xbar_reserved7[3];

        union {
            uint32_t R;
            struct {
                uint32_t R0:1;
                  uint32_t:21;
                uint32_t ARB:2;
                  uint32_t:2;
                uint32_t PCTL:2;
                  uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR3;               /* Master Priority Register 3 */

        uint32_t xbar_reserved8[186];

        union {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3;
                  uint32_t:1;
                uint32_t MSTR6:3;
                  uint32_t:9;
                uint32_t MSTR5:3;
                  uint32_t:1;
                uint32_t MSTR3:3;
                  uint32_t:1;
                uint32_t MSTR2:3;
                  uint32_t:1;
                uint32_t MSTR1:3;
                  uint32_t:1;
                uint32_t MSTR0:1;
            } B;
        } MPR6;                 /* Master Priority Register 6 */

        uint32_t xbar_reserved9[3];

        union {
            uint32_t R;
            struct {
                uint32_t R0:1;
                  uint32_t:21;
                uint32_t ARB:2;
                  uint32_t:2;
                uint32_t PCTL:2;
                  uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR6;               /* Master Priority Register 6 */

        uint32_t xbar_reserved10[58];

        union {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3;
                  uint32_t:1;
                uint32_t MSTR6:3;
                  uint32_t:9;
                uint32_t MSTR5:3;
                  uint32_t:1;
                uint32_t MSTR3:3;
                  uint32_t:1;
                uint32_t MSTR2:3;
                  uint32_t:1;
                uint32_t MSTR1:3;
                  uint32_t:1;
                uint32_t MSTR0:1;
            } B;
        } MPR7;                 /* Master Priority Register 7 */

        uint32_t xbar_reserved11[3];

        union {
            uint32_t R;
            struct {
                uint32_t R0:1;
                  uint32_t:21;
                uint32_t ARB:2;
                  uint32_t:2;
                uint32_t PCTL:2;
                  uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR7;               /* Master Priority Register 7 */

        uint32_t xbar_reserved12[506];

        union {
            uint32_t R;
            struct {
                uint32_t R0:1;
                  uint32_t:21;
                uint32_t ARB:2;
                  uint32_t:2;
                uint32_t PCTL:2;
                  uint32_t:1;
                uint32_t PARK:3;
            } B;
        } MGPCR7;               /* Master General Purpose Register 7 */

