RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
    };
/*************************************************************************/
/*                            MODULE : CRP                               */
/*************************************************************************/
    struct CRP_tag {

        union {
            uint32_t R;
            struct {
                uint32_t IRCTRIMEN:1;
                  uint32_t:4;
                uint32_t PREDIV:3;
                  uint32_t:4;
                uint32_t EN128KIRC:1;
                uint32_t EN32KOSC:1;
                uint32_t ENLPOSC:1;
                uint32_t EN40MOSC:1;
                  uint32_t:3;
                uint32_t TRIM128IRC:5;
                  uint32_t:2;
                uint32_t TRIM16IRC:6;
            } B;
        } CLKSRC;               /* CLOCK SOURCE REGISTER */

        uint32_t crp_reserved1[3];

        union {
            uint32_t R;
            struct {
                uint32_t CNTEN:1;
                uint32_t RTCIE:1;
                uint32_t FRZEN:1;
                uint32_t ROVREN:1;
                uint32_t RTCVAL:12;
                uint32_t APIEN:1;
                uint32_t APIIE:1;
                uint32_t CLKSEL:2;
                uint32_t DIV512EN:1;
                uint32_t DIV32EN:1;
                uint32_t APIVAL:10;
            } B;
        } RTCC;                 /* RTC CONTROL REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t:2;
                uint32_t RTCF:1;
                  uint32_t:15;
                uint32_t APIF:1;
                  uint32_t:2;
                uint32_t ROVRF:1;
                  uint32_t:10;
            } B;
        } RTSC;                 /* RTC STATUS REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t RTCCNT:32;
            } B;
        } RTCCNT;               /* RTC Counter Register */

        uint32_t crp_reserved2[9];

        union {
            uint32_t R;
            struct {
                uint32_t PWK31:2;
                uint32_t PWK30:2;
                uint32_t PWK29:2;
                uint32_t PWK28:2;
                uint32_t PWK27:2;
                uint32_t PWK26:2;
                uint32_t PWK25:2;
                uint32_t PWK24:2;
                uint32_t PWK23:2;
                uint32_t PWK22:2;
                uint32_t PWK21:2;
                uint32_t PWK20:2;
                uint32_t PWK19:2;
                uint32_t PWK18:2;
                uint32_t PWK17:2;
                uint32_t PWK16:2;
            } B;
        } PWKENH;               /* PIN WAKEUP ENABLE HIGH REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t PWK15:2;
                uint32_t PWK14:2;
                uint32_t PWK13:2;
                uint32_t PWK12:2;
                uint32_t PWK11:2;
                uint32_t PWK10:2;
                uint32_t PWK9:2;
                uint32_t PWK8:2;
                uint32_t PWK7:2;
                uint32_t PWK6:2;
                uint32_t PWK5:2;
                uint32_t PWK4:2;
                uint32_t PWK3:2;
                uint32_t PWK2:2;
                uint32_t PWK1:2;
                uint32_t PWK0:2;
            } B;
        } PWKENL;               /* PIN WAKEUP ENABLE LOW REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t PWKSRCIE31:1;
                uint32_t PWKSRCIE30:1;
                uint32_t PWKSRCIE29:1;
                uint32_t PWKSRCIE28:1;
                uint32_t PWKSRCIE27:1;
                uint32_t PWKSRCIE26:1;
                uint32_t PWKSRCIE25:1;
                uint32_t PWKSRCIE24:1;
                uint32_t PWKSRCIE23:1;
                uint32_t PWKSRCIE22:1;
                uint32_t PWKSRCIE21:1;
                uint32_t PWKSRCIE20:1;
                uint32_t PWKSRCIE19:1;
                uint32_t PWKSRCIE18:1;
                uint32_t PWKSRCIE17:1;
                uint32_t PWKSRCIE16:1;
                uint32_t PWKSRCIE15:1;
                uint32_t PWKSRCIE14:1;
                uint32_t PWKSRCIE13:1;
                uint32_t PWKSRCIE12:1;
                uint32_t PWKSRCIE11:1;
                uint32_t PWKSRCIE10:1;
                uint32_t PWKSRCIE9:1;
                uint32_t PWKSRCIE8:1;
                uint32_t PWKSRCIE7:1;
                uint32_t PWKSRCIE6:1;
                uint32_t PWKSRCIE5:1;
                uint32_t PWKSRCIE4:1;
                uint32_t PWKSRCIE3:1;
                uint32_t PWKSRCIE2:1;
                uint32_t PWKSRCIE1:1;
                uint32_t PWKSRCIE0:1;
            } B;
        } PWKSRCIE;             /* PIN WAKEUP SOURCE INTERRUPT ENABLE REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t PWKSRCIE31:1;
                uint32_t PWKSRCIE30:1;
                uint32_t PWKSRCIE29:1;
                uint32_t PWKSRCIE28:1;
                uint32_t PWKSRCIE27:1;
                uint32_t PWKSRCIE26:1;
                uint32_t PWKSRCIE25:1;
                uint32_t PWKSRCIE24:1;
                uint32_t PWKSRCIE23:1;
                uint32_t PWKSRCIE22:1;
                uint32_t PWKSRCIE21:1;
                uint32_t PWKSRCIE20:1;
                uint32_t PWKSRCIE19:1;
                uint32_t PWKSRCIE18:1;
                uint32_t PWKSRCIE17:1;
                uint32_t PWKSRCIE16:1;
                uint32_t PWKSRCIE15:1;
                uint32_t PWKSRCIE14:1;
                uint32_t PWKSRCIE13:1;
                uint32_t PWKSRCIE12:1;
                uint32_t PWKSRCIE11:1;
                uint32_t PWKSRCIE10:1;
                uint32_t PWKSRCIE9:1;
                uint32_t PWKSRCIE8:1;
                uint32_t PWKSRCIE7:1;
                uint32_t PWKSRCIE6:1;
                uint32_t PWKSRCIE5:1;
                uint32_t PWKSRCIE4:1;
                uint32_t PWKSRCIE3:1;
                uint32_t PWKSRCIE2:1;
                uint32_t PWKSRCIE1:1;
                uint32_t PWKSRCIE0:1;
            } B;
        } PWKSRCF;              /* PIN WAKEUP SOURCE FLAG REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t Z6VECB:20;
                  uint32_t:10;
                uint32_t Z6RST:1;
                uint32_t VLE:1;
            } B;
        } Z6VEC;                /* Z6 RESET VECTOR REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t Z0VECB:30;
                uint32_t Z0RST:1;
                  uint32_t:1;
            } B;
        } Z0VEC;                /* Z0 RESET VECTOR REGISTER */

        union {
            uint32_t R;
            struct {
                uint32_t RECPTR:30;
                uint32_t FASTREC:1;
                  uint32_t:1;
            } B;
        } RECPTR;               /* RESET RECOVERY POINTER REGISTER */

        uint32_t crp_reserved3;

        union {
            uint32_t R;
            struct {
                uint32_t SLEEPF:1;
                  uint32_t:12;
                uint32_t RTCOVRWKF:1;
                uint32_t RTCWKF:1;
                uint32_t APIWKF:1;
                uint32_t SLEEP:1;
                  uint32_t:4;
                uint32_t RAMSEL:3;
                  uint32_t:4;
                uint32_t WKCLKSEL:1;
                uint32_t RTCOVRWKEN:1;
                uint32_t RTCWKEN:1;
                uint32_t APIWKEN:1;
            } B;
        } PSCR;                 /* POWER STATUS AND CONTROL REGISTER */

        uint32_t crp_reserved4[3];

        union {
            uint32_t R;
            struct {
                uint32_t LVI5LOCK:1;
                uint32_t LVI5RE:1;
                  uint32_t:7;
                uint32_t LVI5HIE:1;
                uint32_t LVI5NIE:1;
                uint32_t LVI5IE:1;
                  uint32_t:2;
                uint32_t FRIE:1;
                uint32_t FDIS:1;
                  uint32_t:9;
                uint32_t LVI5HIF:1;
                uint32_t LVI5NF:1;
                uint32_t LVI5F:1;
                  uint32_t:2;
                uint32_t FRF:1;
                uint32_t FRDY:1;
            } B;
        } SOCSC;                /* LVI Status and Control Register */

    };                          /* end of CRP_tag */
/*************************************************************************/
/*                          MODULE : CTU                                 */
/*************************************************************************/
    struct CTU_tag {

        union {
            uint32_t R;
            struct {
                uint32_t:24;
                uint32_t TRGIEN:1;
                uint32_t TRGI:1;
                  uint32_t:2;
                uint32_t PRESC_CONF:4;
            } B;
        } CSR;                  /* Control Status Register */

        union {
            uint32_t R;
            struct {
                uint32_t:23;
                uint32_t SV:9;
            } B;
        } SVR[7];               /* Start Value Register */

        union {
            uint32_t R;
            struct {
                uint32_t:23;
                uint32_t CV:9;
            } B;
        } CVR[4];               /* Current Value Register */

        union {
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t TM:1;
                  uint32_t:1;
                uint32_t COUNT_GROUP:2;
                  uint32_t:1;
                uint32_t DELAY_INDEX:3;
                uint32_t CLR_FG:1;
                  uint32_t:1;
                uint32_t CHANNEL_VALUE:6;
            } B;
        } EVTCFGR[33];          /* Event Configuration Register */

