RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
        uint8_t ecsm_reserved2[27];

        union {
            uint8_t R;
            struct {
                uint8_t:2;
                uint8_t EPR1BR:1;
                uint8_t EPF1BR:1;
                  uint8_t:2;
                uint8_t EPRNCR:1;
                uint8_t EPFNCR:1;
            } B;
        } ECR;                  /* ECC Configuration Register */

        uint8_t ecsm_reserved3[3];

        union {
            uint8_t R;
            struct {
                uint8_t:2;
                uint8_t PR1BC:1;
                uint8_t PF1BC:1;
                  uint8_t:2;
                uint8_t PRNCE:1;
                uint8_t PFNCE:1;
            } B;
        } ESR;                  /* ECC Status Register */

        uint16_t ecsm_reserved4;

        union {
            uint16_t R;
            struct {
                uint16_t:2;
                uint16_t FRC1BI:1;
                uint16_t FR11BI:1;
                  uint16_t:2;
                uint16_t FRCNCI:1;
                uint16_t FR1NCI:1;
                uint16_t PREI_SEL:1;
                uint16_t ERRBIT:7;
            } B;
        } EEGR;                 /* ECC Error Generation Register */

        uint32_t ecsm_reserved5;

        union {
            uint32_t R;
            struct {
                uint32_t PFEAR:32;
            } B;
        } PFEAR;                /* Platform Flash ECC Address Register */

        uint16_t ecsm_reserved6;

        union {
            uint8_t R;
            struct {
                uint8_t:4;
                uint8_t PFEMR:4;
            } B;
        } PFEMR;                /* Platform Flash ECC Address Register */

        union {
            uint8_t R;
            struct {
                uint8_t WRITE:1;
                uint8_t SIZE:3;
                uint8_t PROTECTION:4;
            } B;
        } PFEAT;                /* Flash ECC Attributes Register */

        union {
            uint32_t R;
            struct {
                uint32_t PFEDRH:32;
            } B;
        } PFEDRH;               /* Flash ECC Data High Register */

        union {
            uint32_t R;
            struct {
                uint32_t PFEDRL:32;
            } B;
        } PFEDRL;               /* Flash ECC Data Low Register */

        union {
            uint32_t R;
            struct {
                uint32_t PREAR:32;
            } B;
        } PREAR;                /* Platform RAM ECC Address Register */

        uint16_t ecsm_reserved8;

        union {
            uint8_t R;
            struct {
                uint8_t:4;
                uint8_t PREMR:4;
            } B;
        } PREMR;                /* RAM ECC Attributes Register */

        union {
            uint8_t R;
            struct {
                uint8_t WRITE:1;
                uint8_t SIZE:3;
                uint8_t PROTECTION:4;
            } B;
        } PREAT;                /* Platform RAM ECC Attributes Register */

        union {
            uint32_t R;
            struct {
                uint32_t PREDR:32;
            } B;
        } PREDRH;               /* Platform RAM ECC Data Low Register High */

        union {
            uint32_t R;
            struct {
                uint32_t PREDR:32;
            } B;
        } PREDRL;               /* Platform RAM ECC Data Low Register Low */

    };                          /* end of ECSM_tag */
/*************************************************************************/
/*                          MODULE : EMIOS                               */
/*************************************************************************/
    struct EMIOS_tag {
        union EMIOS_MCR_tag {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MDIS:1;
                uint32_t FRZ:1;
                uint32_t GTBE:1;
                  uint32_t:1;
                uint32_t GPREN:1;
                  uint32_t:10;
                uint32_t GPRE:8;
                  uint32_t:8;
            } B;
        } MCR;                  /* Module Configuration Register */

        union {
            uint32_t R;
            struct {
                uint32_t F31:1;
                uint32_t F30:1;
                uint32_t F29:1;
                uint32_t F28:1;
                uint32_t F27:1;
                uint32_t F26:1;
                uint32_t F25:1;
                uint32_t F24:1;
                uint32_t F23:1;
                uint32_t F22:1;
                uint32_t F21:1;
                uint32_t F20:1;
                uint32_t F19:1;
                uint32_t F18:1;
                uint32_t F17:1;
                uint32_t F16:1;
                uint32_t F15:1;
                uint32_t F14:1;
                uint32_t F13:1;
                uint32_t F12:1;
                uint32_t F11:1;
                uint32_t F10:1;
                uint32_t F9:1;
                uint32_t F8:1;
                uint32_t F7:1;
                uint32_t F6:1;
                uint32_t F5:1;
                uint32_t F4:1;
                uint32_t F3:1;
                uint32_t F2:1;
                uint32_t F1:1;
                uint32_t F0:1;
            } B;
        } GFR;                  /* Global FLAG Register */

        union {
            uint32_t R;
            struct {
                uint32_t OU31:1;
                uint32_t OU30:1;
                uint32_t OU29:1;
                uint32_t OU28:1;
                uint32_t OU27:1;
                uint32_t OU26:1;
                uint32_t OU25:1;
                uint32_t OU24:1;
                uint32_t OU23:1;
                uint32_t OU22:1;
                uint32_t OU21:1;
                uint32_t OU20:1;
                uint32_t OU19:1;
                uint32_t OU18:1;
                uint32_t OU17:1;
                uint32_t OU16:1;
                uint32_t OU15:1;
                uint32_t OU14:1;
                uint32_t OU13:1;
                uint32_t OU12:1;
                uint32_t OU11:1;
                uint32_t OU10:1;
                uint32_t OU9:1;
                uint32_t OU8:1;
                uint32_t OU7:1;
                uint32_t OU6:1;
                uint32_t OU5:1;
                uint32_t OU4:1;
                uint32_t OU3:1;
                uint32_t OU2:1;
                uint32_t OU1:1;
                uint32_t OU0:1;
            } B;
        } OUDR;                 /* Output Update Disable Register */

        union {
            uint32_t R;
            struct {
                uint32_t UC31:1;
                uint32_t UC30:1;
                uint32_t UC29:1;
                uint32_t UC28:1;
                uint32_t UC27:1;
                uint32_t UC26:1;
                uint32_t UC25:1;
                uint32_t UC24:1;
                uint32_t UC23:1;
                uint32_t UC22:1;
                uint32_t UC21:1;
                uint32_t UC20:1;
                uint32_t UC19:1;
                uint32_t UC18:1;
                uint32_t UC17:1;
                uint32_t UC16:1;
                uint32_t UC15:1;
                uint32_t UC14:1;
                uint32_t UC13:1;
                uint32_t UC12:1;
                uint32_t UC11:1;
                uint32_t UC10:1;
                uint32_t UC9:1;
                uint32_t UC8:1;
                uint32_t UC7:1;
                uint32_t UC6:1;
                uint32_t UC5:1;
                uint32_t UC4:1;
                uint32_t UC3:1;
                uint32_t UC2:1;
                uint32_t UC1:1;
                uint32_t UC0:1;
            } B;
        } UCDIS;                /* Disable Channel Register */

