RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
        uint8_t eSCI_reserved3[5];
    };                          /* end of ESCI_tag */
/*************************************************************************/
/*                             MODULE : FEC                              */
/*************************************************************************/
    struct FEC_tag {

        uint32_t fec_reserved_start;

        union {
            uint32_t R;
            struct {
                uint32_t HBERR:1;
                uint32_t BABR:1;
                uint32_t BABT:1;
                uint32_t GRA:1;
                uint32_t TXF:1;
                uint32_t TXB:1;
                uint32_t RXF:1;
                uint32_t RXB:1;
                uint32_t MII:1;
                uint32_t EBERR:1;
                uint32_t LC:1;
                uint32_t RL:1;
                uint32_t UN:1;
                  uint32_t:19;
            } B;
        } EIR;                  /*  Interrupt Event Register */

        union {
            uint32_t R;
            struct {
                uint32_t HBERR:1;
                uint32_t BABR:1;
                uint32_t BABT:1;
                uint32_t GRA:1;
                uint32_t TXF:1;
                uint32_t TXB:1;
                uint32_t RXF:1;
                uint32_t RXB:1;
                uint32_t MII:1;
                uint32_t EBERR:1;
                uint32_t LC:1;
                uint32_t RL:1;
                uint32_t UN:1;
                  uint32_t:19;
            } B;
        } EIMR;                 /*  Interrupt Mask Register  */

        uint32_t fec_reserved_eimr;

        union {
            uint32_t R;
            struct {
                uint32_t:7;
                uint32_t R_DES_ACTIVE:1;
                  uint32_t:24;
            } B;
        } RDAR;                 /*  Receive Descriptor Active Register  */

        union {
            uint32_t R;
            struct {
                uint32_t:7;
                uint32_t X_DES_ACTIVE:1;
                  uint32_t:24;
            } B;
        } TDAR;                 /*  Transmit Descriptor Active Register  */

        uint32_t fec_reserved_tdar[3];

        union {
            uint32_t R;
            struct {
                uint32_t:30;
                uint32_t ETHER_EN:1;
                uint32_t RESET:1;
            } B;
        } ECR;                  /*  Ethernet Control Register  */

        uint32_t fec_reserved_ecr[6];

        union {
            uint32_t R;
            struct {
                uint32_t ST:2;
                uint32_t OP:2;
                uint32_t PA:5;
                uint32_t RA:5;
                uint32_t TA:2;
                uint32_t DATA:16;
            } B;
        } MMFR;                 /* MII Data Register */

        union {
            uint32_t R;
            struct {
                uint32_t:24;
                uint32_t DIS_PREAMBLE:1;
                uint32_t MII_SPEED:6;
                  uint32_t:1;
            } B;
        } MSCR;                 /* MII Speed Control Register */

        uint32_t fec_reserved_mscr[7];

        union {
            uint32_t R;
            struct {
                uint32_t MIB_DISABLE:1;
                uint32_t MIB_IDLE:1;
                  uint32_t:30;
            } B;
        } MIBC;                 /* MIB Control Register */

        uint32_t fec_reserved_mibc[7];

        union {
            uint32_t R;
            struct {
                uint32_t:5;
                uint32_t MAX_FL:11;
                  uint32_t:10;
                uint32_t FCE:1;
                uint32_t BC_REJ:1;
                uint32_t PROM:1;
                uint32_t MII_MODE:1;
                uint32_t DRT:1;
                uint32_t LOOP:1;
            } B;
        } RCR;                  /* Receive Control Register */

        uint32_t fec_reserved_rcr[15];

        union {
            uint32_t R;
            struct {
                uint32_t:27;
                uint32_t RFC_PAUSE:1;
                uint32_t TFC_PAUSE:1;
                uint32_t FDEN:1;
                uint32_t HBC:1;
                uint32_t GTS:1;
            } B;
        } TCR;                  /* Transmit Control Register */

        uint32_t fec_reserved_tcr[7];

        union {
            uint32_t R;
            struct {
                uint32_t PADDR1:32;
            } B;
        } PALR;                 /* Physical Address Low Register */

        union {
            uint32_t R;
            struct {
                uint32_t PADDR2:16;
                uint32_t TYPE:16;
            } B;
        } PAUR;                 /* Physical Address High + Type Register */

        union {
            uint32_t R;
            struct {
                uint32_t OPCODE:16;
                uint32_t PAUSE_DUR:16;
            } B;
        } OPD;                  /* Opcode/Pause Duration Register */

        uint32_t fec_reserved_opd[10];

        union {
            uint32_t R;
            struct {
                uint32_t IADDR1:32;
            } B;
        } IAUR;                 /* Descriptor Individual Upper Address Register */

        union {
            uint32_t R;
            struct {
                uint32_t IADDR2:32;
            } B;
        } IALR;                 /* Descriptor Individual Lower Address Register */

        union {
            uint32_t R;
            struct {
                uint32_t GADDR1:32;
            } B;
        } GAUR;                 /* Descriptor Group Upper Address Register */

        union {
            uint32_t R;
            struct {
                uint32_t GADDR2:32;
            } B;
        } GALR;                 /* Descriptor Group Lower Address Register */

        uint32_t fec_reserved_galr[7];

        union {
            uint32_t R;
            struct {
                uint32_t:30;
                uint32_t X_WMRK:2;
            } B;
        } TFWR;                 /* FIFO Transmit FIFO Watermark Register */

        uint32_t fec_reserved_tfwr;

        union {
            uint32_t R;
            struct {
                uint32_t:22;
                uint32_t R_BOUND:8;
                  uint32_t:2;
            } B;
        } FRBR;                 /* FIFO Receive Bound Register */

        union {
            uint32_t R;
            struct {
                uint32_t:22;
                uint32_t R_FSTART:8;
                  uint32_t:2;
            } B;
        } FRSR;                 /* FIFO Receive Start Register */

        uint32_t fec_reserved_frsr[11];

        union {
            uint32_t R;
            struct {
                uint32_t R_DES_START:30;
                  uint32_t:2;
            } B;
        } ERDSR;                /* Receive Descriptor Ring Start Register */

        union {
            uint32_t R;
            struct {
                uint32_t X_DES_START:30;
                  uint32_t:2;
            } B;
        } ETDSR;                /* Transmit Descriptor Ring Start Register */

        union {
            uint32_t R;
            struct {
                uint32_t:21;
                uint32_t R_BUF_SIZE:7;
                  uint32_t:4;
            } B;
        } EMRBR;                /* Receive Buffer Size Register */

        uint32_t fec_reserved_emrbr[29];

        union {
            uint32_t R;
        } RMON_T_DROP;          /* Count of frames not counted correctly */

        union {
            uint32_t R;
        } RMON_T_PACKETS;       /* RMON Tx packet count */

        union {
            uint32_t R;
        } RMON_T_BC_PKT;        /* RMON Tx Broadcast Packets */

        union {
            uint32_t R;
        } RMON_T_MC_PKT;        /* RMON Tx Multicast Packets */

        union {
            uint32_t R;
        } RMON_T_CRC_ALIGN;     /* RMON Tx Packets w CRC/Align error */

        union {
            uint32_t R;
        } RMON_T_UNDERSIZE;     /* RMON Tx Packets < 64 bytes, good crc */

        union {
            uint32_t R;
        } RMON_T_OVERSIZE;      /* RMON Tx Packets > MAX_FL bytes, good crc */

        union {
            uint32_t R;
        } RMON_T_FRAG;          /* RMON Tx Packets < 64 bytes, bad crc */

        union {
            uint32_t R;
        } RMON_T_JAB;           /* RMON Tx Packets > MAX_FL bytes, bad crc */

        union {
            uint32_t R;
        } RMON_T_COL;           /* RMON Tx collision count */

        union {
            uint32_t R;
        } RMON_T_P64;           /* RMON Tx 64 byte packets */

        union {
            uint32_t R;
        } RMON_T_P65TO127;      /* RMON Tx 65 to 127 byte packets */

        union {
            uint32_t R;
        } RMON_T_P128TO255;     /* RMON Tx 128 to 255 byte packets */

        union {
            uint32_t R;
        } RMON_T_P256TO511;     /* RMON Tx 256 to 511 byte packets */

        union {
            uint32_t R;
        } RMON_T_P512TO1023;    /* RMON Tx 512 to 1023 byte packets */

        union {
            uint32_t R;
        } RMON_T_P1024TO2047;   /* RMON Tx 1024 to 2047 byte packets */

        union {
            uint32_t R;
        } RMON_T_P_GTE2048;     /* RMON Tx packets w > 2048 bytes */

        union {
            uint32_t R;
        } RMON_T_OCTETS;        /* RMON Tx Octets */

        union {
            uint32_t R;
        } IEEE_T_DROP;          /* Count of frames not counted correctly */

        union {
            uint32_t R;
        } IEEE_T_FRAME_OK;      /* Frames Transmitted OK */

        union {
            uint32_t R;
        } IEEE_T_1COL;          /* Frames Transmitted with Single Collision */

        union {
            uint32_t R;
        } IEEE_T_MCOL;          /* Frames Transmitted with Multiple Collisions */

        union {
            uint32_t R;
        } IEEE_T_DEF;           /* Frames Transmitted after Deferral Delay */

        union {
            uint32_t R;
        } IEEE_T_LCOL;          /* Frames Transmitted with Late Collision */

        union {
            uint32_t R;
        } IEEE_T_EXCOL;         /* Frames Transmitted with Excessive Collisions */

        union {
            uint32_t R;
        } IEEE_T_MACERR;        /* Frames Transmitted with Tx FIFO Underrun */

        union {
            uint32_t R;
        } IEEE_T_CSERR;         /* Frames Transmitted with Carrier Sense Error */

        union {
            uint32_t R;
        } IEEE_T_SQE;           /* Frames Transmitted with SQE Error */

        union {
            uint32_t R;
        } IEEE_T_FDXFC;         /* Flow Control Pause frames transmitted */

        union {
            uint32_t R;
        } IEEE_T_OCTETS_OK;     /* Octet count for Frames Transmitted w/o Error */

