RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
        uint32_t fec_reserved_rmon_t_octets_ok[2];

        union {
            uint32_t R;
        } RMON_R_DROP;          /*  Count of frames not counted correctly  */

        union {
            uint32_t R;
        } RMON_R_PACKETS;       /* RMON Rx packet count */

        union {
            uint32_t R;
        } RMON_R_BC_PKT;        /* RMON Rx Broadcast Packets */

        union {
            uint32_t R;
        } RMON_R_MC_PKT;        /* RMON Rx Multicast Packets */

        union {
            uint32_t R;
        } RMON_R_CRC_ALIGN;     /* RMON Rx Packets w CRC/Align error */

        union {
            uint32_t R;
        } RMON_R_UNDERSIZE;     /* RMON Rx Packets < 64 bytes, good crc */

        union {
            uint32_t R;
        } RMON_R_OVERSIZE;      /* RMON Rx Packets > MAX_FL bytes, good crc */

        union {
            uint32_t R;
        } RMON_R_FRAG;          /* RMON Rx Packets < 64 bytes, bad crc */

        union {
            uint32_t R;
        } RMON_R_JAB;           /* RMON Rx Packets > MAX_FL bytes, bad crc */

        uint32_t fec_reserved_rmon_r_jab;

        union {
            uint32_t R;
        } RMON_R_P64;           /* RMON Rx 64 byte packets */

        union {
            uint32_t R;
        } RMON_R_P65TO127;      /* RMON Rx 65 to 127 byte packets */

        union {
            uint32_t R;
        } RMON_R_P128TO255;     /* RMON Rx 128 to 255 byte packets */

        union {
            uint32_t R;
        } RMON_R_P256TO511;     /* RMON Rx 256 to 511 byte packets */

        union {
            uint32_t R;
        } RMON_R_P512TO1023;    /* RMON Rx 512 to 1023 byte packets */

        union {
            uint32_t R;
        } RMON_R_P1024TO2047;   /* RMON Rx 1024 to 2047 byte packets */

        union {
            uint32_t R;
        } RMON_R_P_GTE2048;     /* RMON Rx packets w > 2048 bytes */

        union {
            uint32_t R;
        } RMON_R_OCTETS;        /* RMON Rx Octets */

        union {
            uint32_t R;
        } IEEE_R_DROP;          /* Count of frames not counted correctly */

        union {
            uint32_t R;
        } IEEE_R_FRAME_OK;      /* Frames Received OK */

        union {
            uint32_t R;
        } IEEE_R_CRC;           /* Frames Received with CRC Error */

        union {
            uint32_t R;
        } IEEE_R_ALIGN;         /* Frames Received with Alignment Error */

        union {
            uint32_t R;
        } IEEE_R_MACERR;        /* Receive Fifo Overflow count */

        union {
            uint32_t R;
        } IEEE_R_FDXFC;         /* Flow Control Pause frames received */

        union {
            uint32_t R;
        } IEEE_R_OCTETS_OK;     /* Octet count for Frames Rcvd w/o Error */

    };                          /* end of FEC_tag */
/*************************************************************************/
/*                            MODULE : FLASH                             */
/*************************************************************************/
    struct FLASH_tag {
        union {
            uint32_t R;
            struct {
                uint32_t:5;
                uint32_t SIZE:3;
                  uint32_t:1;
                uint32_t LAS:3;
                  uint32_t:3;
                uint32_t MAS:1;
                uint32_t EER:1;
                uint32_t RWE:1;
                uint32_t SBC:1;
                  uint32_t:1;
                uint32_t PEAS:1;
                uint32_t DONE:1;
                uint32_t PEG:1;
                  uint32_t:4;
                uint32_t PGM:1;
                uint32_t PSUS:1;
                uint32_t ERS:1;
                uint32_t ESUS:1;
                uint32_t EHV:1;
            } B;
        } MCR;                  /* Module Configuration Register */

        union {
            uint32_t R;
            struct {
                uint32_t LME:1;
                  uint32_t:10;
                uint32_t SLOCK:1;
                  uint32_t:2;
                uint32_t MLOCK:2;
                  uint32_t:6;
                uint32_t LLOCK:10;
            } B;
        } LML;                  /* Low/Mid-address space block locking Register */

        union {
            uint32_t R;
            struct {
                uint32_t HBE:1;
                  uint32_t:25;
                uint32_t HBLOCK:6;
            } B;
        } HBL;                  /* High-address space block locking Register */

        union {
            uint32_t R;
            struct {
                uint32_t SLE:1;
                  uint32_t:10;
                uint32_t SSLOCK:1;
                  uint32_t:2;
                uint32_t SMLOCK:2;
                  uint32_t:6;
                uint32_t SLLOCK:10;
            } B;
        } SLL;                  /* Secondary low/mid-address space block locking Register */

        union {
            uint32_t R;
            struct {
                uint32_t:14;
                uint32_t MSEL:2;
                  uint32_t:6;
                uint32_t LSEL:10;
            } B;
        } LMS;                  /* Low/Mid-address space block locking Register */

        union {
            uint32_t R;
            struct {
                uint32_t:26;
                uint32_t HBSEL:6;
            } B;
        } HBS;                  /* High-address space block locking Register */

        union {
            uint32_t R;
            struct {
                uint32_t SAD:1;
                  uint32_t:10;
                uint32_t ADDR:18;
                  uint32_t:3;
            } B;
        } ADR;                  /* Address Register */

        union {
            uint32_t R;
            struct {
                uint32_t LBCFG:4;
                uint32_t ARB:1;
                uint32_t PRI:1;
                  uint32_t:1;
                uint32_t M8PFE:1;
                  uint32_t:1;
                uint32_t M6PFE:1;
                uint32_t M5PFE:1;
                uint32_t M4PFE:1;
                  uint32_t:1;
                uint32_t M2PFE:1;
                uint32_t M1PFE:1;
                uint32_t M0PFE:1;
                uint32_t APC:3;
                uint32_t WWSC:2;
                uint32_t RWSC:3;
                  uint32_t:1;
                uint32_t DPFEN:1;
                  uint32_t:1;
                uint32_t IPFEN:1;
                  uint32_t:1;
                uint32_t PFLIM:2;
                uint32_t BFEN:1;
            } B;
        } PFCRP0;               /* Platform Flash Configuration Register for Port 0 */

        union {
            uint32_t R;
            struct {
                uint32_t LBCFG:4;
                  uint32_t:3;
                uint32_t M8PFE:1;
                  uint32_t:1;
                uint32_t M6PFE:1;
                uint32_t M5PFE:1;
                uint32_t M4PFE:1;
                  uint32_t:1;
                uint32_t M2PFE:1;
                uint32_t M1PFE:1;
                uint32_t M0PFE:1;
                uint32_t APC:3;
                uint32_t WWSC:2;
                uint32_t RWSC:3;
                  uint32_t:1;
                uint32_t DPFEN:1;
                  uint32_t:1;
                uint32_t IPFEN:1;
                  uint32_t:1;
                uint32_t PFLIM:2;
                uint32_t BFEN:1;
            } B;
        } PFCRP1;               /* Platform Flash Configuration Register for Port 1 */

        union {
            uint32_t R;
            struct {
                uint32_t M7AP:2;
                uint32_t M6AP:2;
                uint32_t M5AP:2;
                uint32_t M4AP:2;
                uint32_t M3AP:2;
                uint32_t M2AP:2;
                uint32_t M1AP:2;
                uint32_t M0AP:2;
                uint32_t SHSACC:4;
                  uint32_t:4;
                uint32_t SHDACC:4;
                  uint32_t:4;
            } B;
        } PFAPR;                /* Platform Flash access protection Register */

        union {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t SACC:31;
            } B;
        } PFSACC;               /* PFlash Supervisor Access Control Register */

        union {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t DACC:31;
            } B;
        } PFDACC;               /* PFlash Data Access Control Register */

        uint32_t FLASH_reserved1[3];

        union {
            uint32_t R;
            struct {
                uint32_t UTE:1;
                uint32_t SCBE:1;
                  uint32_t:6;
                uint32_t DSI:8;
                  uint32_t:10;
                uint32_t MRE:1;
                uint32_t MRV:1;
                uint32_t EIE:1;
                uint32_t AIS:1;
                uint32_t AIE:1;
                uint32_t AID:1;
            } B;
        } UT0;                  /* User Test Register 0 */

        union {
            uint32_t R;
            struct {
                uint32_t DAI:32;
            } B;
        } UT1;                  /* User Test Register 1 */

        union {
            uint32_t R;
            struct {
                uint32_t DAI:32;
            } B;
        } UT2;                  /* User Test Register 2 */

        union {
            uint32_t R;
            struct {
                uint32_t MISR:32;
            } B;
        } MISR[5];              /* Multiple Input Signature Register */

    };                          /* end of FLASH_tag */
/*************************************************************************/
/*                          MODULE : FlexCAN                             */
/*************************************************************************/
    struct FLEXCAN_tag {
        union {
            uint32_t R;
            struct {
                uint32_t MDIS:1;
                uint32_t FRZ:1;
                uint32_t FEN:1;
                uint32_t HALT:1;
                uint32_t NOTRDY:1;
                uint32_t WAKMSK:1;
                uint32_t SOFTRST:1;
                uint32_t FRZACK:1;
                uint32_t SUPV:1;
                uint32_t SLFWAK:1;
                uint32_t WRNEN:1;
                uint32_t LPMACK:1;
                uint32_t WAKSRC:1;
                uint32_t DOZE:1;
                uint32_t SRXDIS:1;
                uint32_t BCC:1;
                  uint32_t:2;
                uint32_t LPRIO_EN:1;
                uint32_t AEN:1;
                  uint32_t:2;
                uint32_t IDAM:2;
                  uint32_t:2;
                uint32_t MAXMB:6;
            } B;
        } MCR;                  /* Module Configuration Register */

        union {
            uint32_t R;
            struct {
                uint32_t PRESDIV:8;
                uint32_t RJW:2;
                uint32_t PSEG1:3;
                uint32_t PSEG2:3;
                uint32_t BOFFMSK:1;
                uint32_t ERRMSK:1;
                uint32_t CLKSRC:1;
                uint32_t LPB:1;
                uint32_t TWRNMSK:1;
                uint32_t RWRNMSK:1;
                  uint32_t:2;
                uint32_t SMP:1;
                uint32_t BOFFREC:1;
                uint32_t TSYN:1;
                uint32_t LBUF:1;
                uint32_t LOM:1;
                uint32_t PROPSEG:3;
            } B;
        } CTRL;                 /* Control Register */

        union {
            uint32_t R;
        } TIMER;                /* Free Running Timer */

