RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
    typedef struct uMB_HEADER   /* message buffer header */
    {
        F_HEADER_t FRAME_HEADER;
        uint16_t DATA_OFFSET;
        S_STATUS_t SLOT_STATUS;
    } MB_HEADER_t;
/**************************************************************************/
/*                     MODULE : FMPLL                                     */
/**************************************************************************/
    struct FMPLL_tag {

        uint32_t FMPLL_reserved0;

        union FMPLL_SYNSR_tag { /* Synthesiser Status Register */
            uint32_t R;
            struct {
                uint32_t:22;
                uint32_t LOLF:1;
                uint32_t LOC:1;
                uint32_t MODE:1;
                uint32_t PLLSEL:1;
                uint32_t PLLREF:1;
                uint32_t LOCKS:1;
                uint32_t LOCK:1;
                uint32_t LOCF:1;
                uint32_t CALDONE:1;
                uint32_t CALPASS:1;
            } B;
        } SYNSR;

        union FMPLL_ESYNCR1_tag {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t CLKCFG:3;
                  uint32_t:8;
                uint32_t EPREDIV:4;
                  uint32_t:8;
                uint32_t EMFD:8;
            } B;
        } ESYNCR1;

        union FMPLL_ESYNCR2_tag {
            uint32_t R;
            struct {
                uint32_t:8;
                uint32_t LOCEN:1;
                uint32_t LOLRE:1;
                uint32_t LOCRE:1;
                uint32_t LOLIRQ:1;
                uint32_t LOCIRQ:1;
                  uint32_t:1;
                uint32_t ERATE:2;
                  uint32_t:5;
                uint32_t EDEPTH:3;
                  uint32_t:2;
                uint32_t ERFD:6;
            } B;
        } ESYNCR2;

    };
/*************************************************************************/
/*                          MODULE : i2c                                 */
/*************************************************************************/
    struct I2C_tag {
        union {
            uint8_t R;
            struct {
                uint8_t AD:7;
                  uint8_t:1;
            } B;
        } IBAD;                 /* Module Bus Address Register */

        union {
            uint8_t R;
            struct {
                uint8_t MULT:2;
                uint8_t ICR:6;
            } B;
        } IBFD;                 /* Module Bus Frequency Register */

        union {
            uint8_t R;
            struct {
                uint8_t MDIS:1;
                uint8_t IBIE:1;
                uint8_t MS:1;
                uint8_t TX:1;
                uint8_t NOACK:1;
                uint8_t RSTA:1;
                uint8_t DMAEN:1;
                  uint8_t:1;
            } B;
        } IBCR;                 /* Module Bus Control Register */

        union {
            uint8_t R;
            struct {
                uint8_t TCF:1;
                uint8_t IAAS:1;
                uint8_t IBB:1;
                uint8_t IBAL:1;
                  uint8_t:1;
                uint8_t SRW:1;
                uint8_t IBIF:1;
                uint8_t RXAK:1;
            } B;
        } IBSR;                 /* Module Status Register */

        union {
            uint8_t R;
            struct {
                uint8_t DATA:8;
            } B;
        } IBDR;                 /* Module Data Register */

        union {
            uint8_t R;
            struct {
                uint8_t BIIE:1;
                  uint8_t:7;
            } B;
        } IBIC;                 /* Module Interrupt Configuration Register */

    };                          /* end of i2c_tag */
/*************************************************************************/
/*                          MODULE : INTC                                */
/*************************************************************************/
    struct INTC_tag {
        union {
            uint32_t R;
            struct {
                uint32_t:18;
                uint32_t VTES_PRC1:1;
                  uint32_t:4;
                uint32_t HVEN_PRC1:1;
                  uint32_t:2;
                uint32_t VTES:1;
                  uint32_t:4;
                uint32_t HVEN:1;
            } B;
        } MCR;                  /* Module Configuration Register */

        int32_t INTC_reserved1;

        union {
            uint32_t R;
            struct {
                uint32_t:28;
                uint32_t PRI:4;
            } B;
        } CPR;                  /* Processor 0 (Z6) Current Priority Register */

        union {
            uint32_t R;
            struct {
                uint32_t:28;
                uint32_t PRI:4;
            } B;
        } CPR_PRC1;             /* Processor 1 (Z0) Current Priority Register */

        union {
            uint32_t R;
            struct {
                uint32_t VTBA:21;
                uint32_t INTVEC:9;
                  uint32_t:2;
            } B;
        } IACKR;                /* Processor 0 (Z6) Interrupt Acknowledge Register */

        union {
            uint32_t R;
            struct {
                uint32_t VTBA_PRC1:21;
                uint32_t INTVEC_PRC1:9;
                  uint32_t:2;
            } B;
        } IACKR_PRC1;           /* Processor 1 (Z0) Interrupt Acknowledge Register */

        union {
            uint32_t R;
            struct {
                uint32_t:32;
            } B;
        } EOIR;                 /* Processor 0 End of Interrupt Register */

        union {
            uint32_t R;
            struct {
                uint32_t:32;
            } B;
        } EOIR_PRC1;            /* Processor 1 End of Interrupt Register */

        union {
            uint8_t R;
            struct {
                uint8_t:6;
                uint8_t SET:1;
                uint8_t CLR:1;
            } B;
        } SSCIR[8];             /* Software Set/Clear Interruput Register */

        uint32_t intc_reserved2[6];

        union {
            uint8_t R;
            struct {
                uint8_t PRC_SEL:2;
                  uint8_t:2;
                uint8_t PRI:4;
            } B;
        } PSR[316];             /* Software Set/Clear Interrupt Register */

    };                          /* end of INTC_tag */
/*************************************************************************/
/*                           MODULE : MLB                                */
/*************************************************************************/
    struct MLB_tag {

        union {
            uint32_t R;
            struct {
                uint32_t MDE:1;
                uint32_t LBM:1;
                uint32_t MCS:2;
                  uint32_t:1;
                uint32_t MLK:1;
                uint32_t MLE:1;
                uint32_t MHRE:1;
                uint32_t MRS:1;
                  uint32_t:15;
                uint32_t MDA:8;
            } B;
        } DCCR;                 /* Device Control Configuration Register */

        union {
            uint32_t R;
            struct {
                uint32_t:24;
                uint32_t SSRE:1;
                uint32_t SDMU:1;
                uint32_t SDML:1;
                uint32_t SDSC:1;
                uint32_t SDCS:1;
                uint32_t SDNU:1;
                uint32_t SDNL:1;
                uint32_t SDR:1;
            } B;
        } SSCR;                 /* MLB Blank Register */

        union {
            uint32_t R;
            struct {
                uint32_t MSD:32;
            } B;
        } SDCR;                 /* MLB Status Register */

        union {
            uint32_t R;
            struct {
                uint32_t:25;
                uint32_t SMMU:1;
                uint32_t SMML:1;
                uint32_t SMSC:1;
                uint32_t SMCS:1;
                uint32_t SMNU:1;
                uint32_t SMNL:1;
                uint32_t SMR:1;
            } B;
        } SMCR;                 /* RX Control Channel Address Register */

        uint32_t MLB_reserved1[3];

        union {
            uint32_t R;
            struct {
                uint32_t UMA:8;
                uint32_t UMI:8;
                uint32_t MMA:8;
                uint32_t MMI:8;
            } B;
        } VCCR;                 /* Version Control Configuration Register */

        union {
            uint32_t R;
            struct {
                uint32_t SRBA:16;
                uint32_t STBA:16;
            } B;
        } SBCR;                 /* Sync Base Address Config Register */

        union {
            uint32_t R;
            struct {
                uint32_t ARBA:16;
                uint32_t ATBA:16;
            } B;
        } ABCR;                 /* Async Base Address Channel Config Register */

        union {
            uint32_t R;
            struct {
                uint32_t CRBA:16;
                uint32_t CTBA:16;
            } B;
        } CBCR;                 /* Control Base Address Config Register */

        union {
            uint32_t R;
            struct {
                uint32_t IRBA:16;
                uint32_t ITBA:16;
            } B;
        } IBCR;                 /* Isochronous Base Address Config Register */

        union {
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t CSU:16;
            } B;
        } CICR;                 /* Channel Interrupt Config Register */

        uint32_t MLB_reserved2[3];

        struct mlbch_t {

            union {
                uint32_t R;
                struct {
                    uint32_t CE:1;
                    uint32_t TR:1;
                    uint32_t CT:2;
                    uint32_t FSE_FCE:1;
                    uint32_t MDS:2;
                      uint32_t:2;
                    uint32_t MLFS:1;
                      uint32_t:1;
                    uint32_t MBE:1;
                    uint32_t MBS:1;
                    uint32_t MBD:1;
                    uint32_t MDB:1;
                    uint32_t MPE:1;
                    uint32_t FSCD_IPL:1;
                    uint32_t IPL:2;
                    uint32_t FSPC_IPL:5;
                    uint32_t CA:8;
                } B;
            } CECR;             /* Channel Entry Config Register */

            union {
                uint32_t R;
                struct {
                    uint32_t BM:1;
                    uint32_t BF:1;
                      uint32_t:10;
                    uint32_t IVB:2;
                    uint32_t GIRB_GB:1;
                    uint32_t RDY:1;
                      uint32_t:4;
                    uint32_t PBS:1;
                    uint32_t PBD:1;
                    uint32_t PBDB:1;
                    uint32_t PBPE:1;
                      uint32_t:1;
                    uint32_t LFS:1;
                    uint32_t HBE:1;
                    uint32_t BE:1;
                    uint32_t CBS:1;
                    uint32_t CBD:1;
                    uint32_t CBDB:1;
                    uint32_t CBPE:1;
                } B;
            } CSCR;             /* Channel Status Config Register */

            union {
                uint32_t R;
                struct {
                    uint32_t BCA:16;
                    uint32_t BFA:16;
                } B;
            } CCBCR;            /* Channel Current Buffer Config Register */

            union {
                uint32_t R;
                struct {
                    uint32_t BSA:16;
                    uint32_t BEA:16;
                } B;
            } CNBCR;            /* Channel Next Buffer Config Register */

        } CH[16];

        uint32_t MLB_reserved3[80];

        union {
            uint32_t R;
            struct {
                uint32_t BSA:16;
                uint32_t BEA:16;
            } B;
        } LCBCR[16];            /* Local Channel Buffer Config Register */

