RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
    };                          /* end of MLB_tag */
/*************************************************************************/
/*                          MODULE : MPU                                 */
/*************************************************************************/
    struct MPU_tag {
        union {
            uint32_t R;
            struct {
                uint32_t MPERR:8;
                  uint32_t:4;
                uint32_t HRL:4;
                uint32_t NSP:4;
                uint32_t NGRD:4;
                  uint32_t:7;
                uint32_t VLD:1;
            } B;
        } CESR;                 /* Module Control/Error Status Register */

        uint32_t mpu_reserved1[3];

        union {
            uint32_t R;
            struct {
                uint32_t EADDR:32;
            } B;
        } EAR0;                 /* Error Address Register */

        union {
            uint32_t R;
            struct {
                uint32_t EACD:16;
                uint32_t EPID:8;
                uint32_t EMN:4;
                uint32_t EATTR:3;
                uint32_t ERW:1;
            } B;
        } EDR0;                 /* Error Detail Register */

        union {
            uint32_t R;
            struct {
                uint32_t EADDR:32;
            } B;
        } EAR1;

        union {
            uint32_t R;
            struct {
                uint32_t EACD:16;
                uint32_t EPID:8;
                uint32_t EMN:4;
                uint32_t EATTR:3;
                uint32_t ERW:1;
            } B;
        } EDR1;

        union {
            uint32_t R;
            struct {
                uint32_t EADDR:32;
            } B;
        } EAR2;

        union {
            uint32_t R;
            struct {
                uint32_t EACD:16;
                uint32_t EPID:8;
                uint32_t EMN:4;
                uint32_t EATTR:3;
                uint32_t ERW:1;
            } B;
        } EDR3;

        union {
            uint32_t R;
            struct {
                uint32_t EADDR:32;
            } B;
        } EAR3;

        union {
            uint32_t R;
            struct {
                uint32_t EACD:16;
                uint32_t EPID:8;
                uint32_t EMN:4;
                uint32_t EATTR:3;
                uint32_t ERW:1;
            } B;
        } EDR2;

        uint32_t mpu_reserved2[244];

        struct {
            union {
                uint32_t R;
                struct {
                    uint32_t SRTADDR:27;
                      uint32_t:5;
                } B;
            } WORD0;            /* Region Descriptor n Word 0 */

            union {
                uint32_t R;
                struct {
                    uint32_t ENDADDR:27;
                      uint32_t:5;
                } B;
            } WORD1;            /* Region Descriptor n Word 1 */

            union {
                uint32_t R;
                struct {
                    uint32_t:2;
                    uint32_t M6RE:1;
                    uint32_t M6WE:1;
                    uint32_t M5RE:1;
                    uint32_t M5WE:1;
                    uint32_t M4RE:1;
                    uint32_t M4WE:1;
                      uint32_t:6;
                    uint32_t M2PE:1;
                    uint32_t M2SM:2;
                    uint32_t M2UM:3;
                    uint32_t M1PE:1;
                    uint32_t M1SM:2;
                    uint32_t M1UM:3;
                    uint32_t M0PE:1;
                    uint32_t M0SM:2;
                    uint32_t M0UM:3;
                } B;
            } WORD2;            /* Region Descriptor n Word 2 */

            union {
                uint32_t R;
                struct {
                    uint32_t PID:8;
                    uint32_t PIDMASK:8;
                      uint32_t:15;
                    uint32_t VLD:1;
                } B;
            } WORD3;            /* Region Descriptor n Word 3 */

        } RGD[16];

        uint32_t mpu_reserved3[192];

        union {
            uint32_t R;
            struct {
                uint32_t:2;
                uint32_t M6RE:1;
                uint32_t M6WE:1;
                uint32_t M5RE:1;
                uint32_t M5WE:1;
                uint32_t M4RE:1;
                uint32_t M4WE:1;
                  uint32_t:6;
                uint32_t M2PE:1;
                uint32_t M2SM:2;
                uint32_t M2UM:3;
                uint32_t M1PE:1;
                uint32_t M1SM:2;
                uint32_t M1UM:3;
                uint32_t M0PE:1;
                uint32_t M0SM:2;
                uint32_t M0UM:3;
            } B;
        } RGDAAC[16];           /* Region Descriptor Alternate Access Control n */
    };
/**************************************************************************/
/*                          MODULE : pit                                  */
/**************************************************************************/
    struct PIT_tag {

        union PIT_MCR_tag {
            uint32_t R;
            struct {
                uint32_t:30;
                uint32_t MDIS:1;
                uint32_t FRZ:1;
            } B;
        } PITMCR;

        uint32_t pit_reserved1[59];

        struct PIT_CHANNEL_tag {
            union {
                uint32_t R;
                struct {
                    uint32_t TSV:32;
                } B;
            } LDVAL;

            union {
                uint32_t R;
                struct {
                    uint32_t TVL:32;
                } B;
            } CVAL;

            union PIT_TCTRL_tag {
                uint32_t R;
                struct {
                    uint32_t:30;
                    uint32_t TIE:1;
                    uint32_t TEN:1;
                } B;
            } TCTRL;

            union PIT_TFLG_tag {
                uint32_t R;
                struct {
                    uint32_t:31;
                    uint32_t TIF:1;
                } B;
            } TFLG;
        } CHANNEL[9];
    };

