RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
    /* Compatibility with MPC5643L */
    typedef struct PIT_CHANNEL_tag PIT_RTI_CHANNEL_tag;
    typedef union PIT_MCR_tag PIT_RTI_PITMCR_32B_tag;
    typedef union PIT_TCTRL_tag PIT_RTI_TCTRL_32B_tag;
    typedef union PIT_TFLG_tag PIT_RTI_TFLG_32B_tag;
/**************************************************************************/
/*                          MODULE : sem4                                 */
/**************************************************************************/
    struct SEMA4_tag {
        union {
            uint8_t R;
            struct {
                uint8_t:6;
                uint8_t GTFSM:2;
            } B;
        } GATE[16];             /* Gate n Register */

        uint32_t sema4_reserved1[12];   /* {0x40-0x10}/4 = 0x0C */

        union {
            uint16_t R;
            struct {
                uint16_t INE0:1;
                uint16_t INE1:1;
                uint16_t INE2:1;
                uint16_t INE3:1;
                uint16_t INE4:1;
                uint16_t INE5:1;
                uint16_t INE6:1;
                uint16_t INE7:1;
                uint16_t INE8:1;
                uint16_t INE9:1;
                uint16_t INE10:1;
                uint16_t INE11:1;
                uint16_t INE12:1;
                uint16_t INE13:1;
                uint16_t INE14:1;
                uint16_t INE15:1;
            } B;
        } CP0INE;

        uint16_t sema4_reserved2[3];    /* {0x48-0x42}/2 = 0x03 */

        union {
            uint16_t R;
            struct {
                uint16_t INE0:1;
                uint16_t INE1:1;
                uint16_t INE2:1;
                uint16_t INE3:1;
                uint16_t INE4:1;
                uint16_t INE5:1;
                uint16_t INE6:1;
                uint16_t INE7:1;
                uint16_t INE8:1;
                uint16_t INE9:1;
                uint16_t INE10:1;
                uint16_t INE11:1;
                uint16_t INE12:1;
                uint16_t INE13:1;
                uint16_t INE14:1;
                uint16_t INE15:1;
            } B;
        } CP1INE;

        uint16_t sema4_reserved3[27];   /* {0x80-0x4A}/2 = 0x1B */

        union {
            uint16_t R;
            struct {
                uint16_t GN0:1;
                uint16_t GN1:1;
                uint16_t GN2:1;
                uint16_t GN3:1;
                uint16_t GN4:1;
                uint16_t GN5:1;
                uint16_t GN6:1;
                uint16_t GN7:1;
                uint16_t GN8:1;
                uint16_t GN9:1;
                uint16_t GN10:1;
                uint16_t GN11:1;
                uint16_t GN12:1;
                uint16_t GN13:1;
                uint16_t GN14:1;
                uint16_t GN15:1;
            } B;
        } CP0NTF;

        uint16_t sema4_reserved4[3];    /* {0x88-0x82}/2 = 0x03 */

        union {
            uint16_t R;
            struct {
                uint16_t GN0:1;
                uint16_t GN1:1;
                uint16_t GN2:1;
                uint16_t GN3:1;
                uint16_t GN4:1;
                uint16_t GN5:1;
                uint16_t GN6:1;
                uint16_t GN7:1;
                uint16_t GN8:1;
                uint16_t GN9:1;
                uint16_t GN10:1;
                uint16_t GN11:1;
                uint16_t GN12:1;
                uint16_t GN13:1;
                uint16_t GN14:1;
                uint16_t GN15:1;
            } B;
        } CP1NTF;

        uint16_t sema4_reserved5[59];   /* {0x100-0x8A}/2 = 0x3B */

        union {
            uint16_t R;
            struct {
                uint16_t:2;
                uint16_t RSTGSM:2;
                  uint16_t:1;
                uint16_t RSTGMS:3;
                uint16_t RSTGTN:8;
            } B;
        } RSTGT;

        uint16_t sema4_reserved6;

        union {
            uint16_t R;
            struct {
                uint16_t:2;
                uint16_t RSTNSM:2;
                  uint16_t:1;
                uint16_t RSTNMS:3;
                uint16_t RSTNTN:8;
            } B;
        } RSTNTF;
    };
/*************************************************************************/
/*                            MODULE : SIU                               */
/*************************************************************************/
    struct SIU_tag {

        int32_t SIU_reserved0;

        union {
            uint32_t R;
            struct {
                uint32_t PARTNUM:16;
                uint32_t CSP:1;
                uint32_t PKG:5;
                  uint32_t:2;
                uint32_t MASKNUM_MAJOR:4;
                uint32_t MASKNUM_MINOR:4;
            } B;
        } MIDR;                 /* MCU ID Register */

        int32_t SIU_reserved1;

        union {
            uint32_t R;
            struct {
                uint32_t PORS:1;
                uint32_t ERS:1;
                uint32_t LLRS:1;
                uint32_t LCRS:1;
                uint32_t WDRS:1;
                uint32_t CRS:1;
                  uint32_t:8;
                uint32_t SSRS:1;
                  uint32_t:15;
                uint32_t BOOTCFG:1;
                  uint32_t:1;
            } B;
        } RSR;                  /* Reset Status Register */

        union {
            uint32_t R;
            struct {
                uint32_t SSR:1;
                  uint32_t:15;
                uint32_t CRE0:1;
                uint32_t CRE1:1;
                  uint32_t:6;
                uint32_t SSRL:1;
                  uint32_t:7;
            } B;
        } SRCR;                 /* System Reset Control Register */

        union {
            uint32_t R;
            struct {
                uint32_t NMI0:1;
                uint32_t NMI1:1;
                  uint32_t:14;
                uint32_t EIF15:1;
                uint32_t EIF14:1;
                uint32_t EIF13:1;
                uint32_t EIF12:1;
                uint32_t EIF11:1;
                uint32_t EIF10:1;
                uint32_t EIF9:1;
                uint32_t EIF8:1;
                uint32_t EIF7:1;
                uint32_t EIF6:1;
                uint32_t EIF5:1;
                uint32_t EIF4:1;
                uint32_t EIF3:1;
                uint32_t EIF2:1;
                uint32_t EIF1:1;
                uint32_t EIF0:1;
            } B;
        } EISR;                 /* External Interrupt Status Register */

