RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
        int32_t SIU_reserved5[26];

        union {
            uint32_t R;
            struct {
                uint32_t ESEL15:2;
                uint32_t ESEL14:2;
                uint32_t ESEL13:2;
                uint32_t ESEL12:2;
                uint32_t ESEL11:2;
                uint32_t ESEL10:2;
                uint32_t ESEL9:2;
                uint32_t ESEL8:2;
                uint32_t ESEL7:2;
                uint32_t ESEL6:2;
                uint32_t ESEL5:2;
                uint32_t ESEL4:2;
                uint32_t ESEL3:2;
                uint32_t ESEL2:2;
                uint32_t ESEL1:2;
                uint32_t ESEL0:2;
            } B;
        } ISEL1;                /* IMUX Register */

        union {
            uint32_t R;
            struct {
                uint32_t ESEL15:2;
                uint32_t ESEL14:2;
                uint32_t ESEL13:2;
                uint32_t ESEL12:2;
                uint32_t ESEL11:2;
                uint32_t ESEL10:2;
                uint32_t ESEL9:2;
                uint32_t ESEL8:2;
                uint32_t ESEL7:2;
                uint32_t ESEL6:2;
                uint32_t ESEL5:2;
                uint32_t ESEL4:2;
                uint32_t ESEL3:2;
                uint32_t ESEL2:2;
                uint32_t ESEL1:2;
                uint32_t ESEL0:2;
            } B;
        } ISEL2;                /* IMUX Register */

        int32_t SIU_reserved6;

        union {
            uint32_t R;
            struct {
                uint32_t:17;
                uint32_t TSEL1:7;
                  uint32_t:1;
                uint32_t TSEL0:7;
            } B;
        } ISEL4;                /* IMUX Register */

        int32_t SIU_reserved7[27];

        union {
            uint32_t R;
            struct {
                uint32_t:14;
                uint32_t MATCH:1;
                uint32_t DISNEX:1;
                  uint32_t:8;
                uint32_t TESTLOCK:1;
                  uint32_t:7;
            } B;
        } CCR;                  /* Chip Configuration Register Register */

        union {
            uint32_t R;
            struct {
                uint32_t:28;
                uint32_t ECEN:1;
                  uint32_t:1;
                uint32_t ECDF:2;
            } B;
        } ECCR;                 /* External Clock Configuration Register Register */

        union {
            uint32_t R;
        } GPR0;                 /* General Purpose Register 0 */

        union {
            uint32_t R;
        } GPR1;                 /* General Purpose Register 1 */

        union {
            uint32_t R;
        } GPR2;                 /* General Purpose Register 2 */

        union {
            uint32_t R;
        } GPR3;                 /* General Purpose Register 3 */

        int32_t SIU_reserved8[2];

        union {
            uint32_t R;
            struct {
                uint32_t SYSCLKSEL:2;
                uint32_t SYSCLKDIV:3;
                  uint32_t:19;
                uint32_t LPCLKDIV3:2;
                uint32_t LPCLKDIV2:2;
                uint32_t LPCLKDIV1:2;
                uint32_t LPCLKDIV0:2;
            } B;
        } SYSCLK;               /* System CLock Register */

        union {
            uint32_t R;
            struct {
                uint32_t:6;
                uint32_t HLT6:1;
                uint32_t HLT7:1;
                  uint32_t:1;
                uint32_t HLT9:1;
                uint32_t HLT10:1;
                uint32_t HLT11:1;
                uint32_t HLT12:1;
                uint32_t HLT13:1;
                uint32_t HLT14:1;
                uint32_t HLT15:1;
                uint32_t HLT16:1;
                uint32_t HLT17:1;
                uint32_t HLT18:1;
                uint32_t HLT19:1;
                uint32_t HLT20:1;
                uint32_t HLT21:1;
                uint32_t HLT22:1;
                uint32_t HLT23:1;
                  uint32_t:2;
                uint32_t HLT26:1;
                uint32_t HLT27:1;
                uint32_t HLT28:1;
                uint32_t HLT29:1;
                  uint32_t:1;
                uint32_t HLT31:1;
            } B;
        } HLT0;                 /* Halt Register 0 */

        union {
            uint32_t R;
            struct {
                uint32_t:3;
                uint32_t HLT3:1;
                uint32_t HLT4:1;
                  uint32_t:15;
                uint32_t HLT20:1;
                uint32_t HLT21:1;
                uint32_t HLT22:1;
                uint32_t HLT23:1;
                  uint32_t:2;
                uint32_t HLT26:1;
                uint32_t HLT27:1;
                uint32_t HLT28:1;
                uint32_t HLT29:1;
                  uint32_t:2;
            } B;
        } HLT1;                 /* Halt Register 1 */

        union {
            uint32_t R;
            struct {
                uint32_t:6;
                uint32_t HLTACK6:1;
                uint32_t HLTACK7:1;
                  uint32_t:1;
                uint32_t HLTACK9:1;
                uint32_t HLTACK10:1;
                uint32_t HLTACK11:1;
                uint32_t HLTACK12:1;
                uint32_t HLTACK13:1;
                uint32_t HLTACK14:1;
                uint32_t HLTACK15:1;
                uint32_t HLTACK16:1;
                uint32_t HLTACK17:1;
                uint32_t HLTACK18:1;
                uint32_t HLTACK19:1;
                uint32_t HLTACK20:1;
                uint32_t HLTACK21:1;
                uint32_t HLTACK22:1;
                uint32_t HLTACK23:1;
                  uint32_t:2;
                uint32_t HLTACK26:1;
                uint32_t HLTACK27:1;
                uint32_t HLTACK28:1;
                uint32_t HLTACK29:1;
                  uint32_t:1;
                uint32_t HLTACK31:1;
            } B;
        } HLTACK0;              /* Halt Acknowledge Register 0 */

        union {
            uint32_t R;
            struct {
                uint32_t HLTACK0:1;
                uint32_t HLTACK1:1;
                  uint32_t:1;
                uint32_t HLTACK3:1;
                uint32_t HLTACK4:1;
                  uint32_t:11;
                uint32_t HLTACK20:1;
                uint32_t HLTACK21:1;
                uint32_t HLTACK22:1;
                uint32_t HLTACK23:1;
                  uint32_t:2;
                uint32_t HLTACK26:1;
                uint32_t HLTACK27:1;
                uint32_t HLTACK28:1;
                uint32_t HLTACK29:1;
                  uint32_t:2;
            } B;
        } HLTACK1;              /* Halt Acknowledge Register 0 */

        union {
            uint32_t R;
            struct {
                uint32_t EMIOSSEL31:4;
                uint32_t EMIOSSEL30:4;
                uint32_t EMIOSSEL29:4;
                uint32_t EMIOSSEL28:4;
                uint32_t EMIOSSEL27:4;
                uint32_t EMIOSSEL26:4;
                uint32_t EMIOSSEL25:4;
                uint32_t EMIOSSEL24:4;
            } B;
        } EMIOS_SEL0;           /* eMIOS Select Register 0 */

        union {
            uint32_t R;
            struct {
                uint32_t EMIOSSEL23:4;
                uint32_t EMIOSSEL22:4;
                uint32_t EMIOSSEL21:4;
                uint32_t EMIOSSEL20:4;
                uint32_t EMIOSSEL19:4;
                uint32_t EMIOSSEL18:4;
                uint32_t EMIOSSEL17:4;
                uint32_t EMIOSSEL16:4;
            } B;
        } EMIOS_SEL1;           /* eMIOS Select Register 1 */

        union {
            uint32_t R;
            struct {
                uint32_t EMIOSSEL15:4;
                uint32_t EMIOSSEL14:4;
                uint32_t EMIOSSEL13:4;
                uint32_t EMIOSSEL12:4;
                uint32_t EMIOSSEL11:4;
                uint32_t EMIOSSEL10:4;
                uint32_t EMIOSSEL9:4;
                uint32_t EMIOSSEL8:4;
            } B;
        } EMIOS_SEL2;           /* eMIOS Select Register 2 */

        union {
            uint32_t R;
            struct {
                uint32_t EMIOSSEL7:4;
                uint32_t EMIOSSEL6:4;
                uint32_t EMIOSSEL5:4;
                uint32_t EMIOSSEL4:4;
                uint32_t EMIOSSEL3:4;
                uint32_t EMIOSSEL2:4;
                uint32_t EMIOSSEL1:4;
                uint32_t EMIOSSEL0:4;
            } B;
        } EMIOS_SEL3;           /* eMIOS Select Register 3 */

        union {
            uint32_t R;
            struct {
                uint32_t ESEL15:2;
                uint32_t ESEL14:2;
                uint32_t ESEL13:2;
                uint32_t ESEL12:2;
                uint32_t ESEL11:2;
                uint32_t ESEL10:2;
                uint32_t ESEL9:2;
                uint32_t ESEL8:2;
                uint32_t ESEL7:2;
                uint32_t ESEL6:2;
                uint32_t ESEL5:2;
                uint32_t ESEL4:2;
                uint32_t ESEL3:2;
                uint32_t ESEL2:2;
                uint32_t ESEL1:2;
                uint32_t ESEL0:2;
            } B;
        } ISEL2A;               /* External Interrupt Select Register 2A */

        int32_t SIU_reserved9[142];

        union {
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t PB:16;
            } B;
        } PGPDO0;               /* Parallel GPIO Pin Data Output Register */

        union {
            uint32_t R;
            struct {
                uint32_t PC:16;
                uint32_t PD:16;
            } B;
        } PGPDO1;               /* Parallel GPIO Pin Data Output Register */

        union {
            uint32_t R;
            struct {
                uint32_t PE:16;
                uint32_t PF:16;
            } B;
        } PGPDO2;               /* Parallel GPIO Pin Data Output Register */

        union {
            uint32_t R;
            struct {
                uint32_t PG:16;
                uint32_t PH:16;
            } B;
        } PGPDO3;               /* Parallel GPIO Pin Data Output Register */

        union {
            uint32_t R;
            struct {
                uint32_t PJ:16;
                uint32_t PK:11;
                  uint32_t:5;
            } B;
        } PGPDO4;               /* Parallel GPIO Pin Data Output Register */

        int32_t SIU_reserved10[11];

        union {
            uint32_t R;
            struct {
                uint32_t PA:16;
                uint32_t PB:16;
            } B;
        } PGPDI0;               /* Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PC:16;
                uint32_t PD:16;
            } B;
        } PGPDI1;               /* Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PE:16;
                uint32_t PF:16;
            } B;
        } PGPDI2;               /* Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PG:16;
                uint32_t PH:16;
            } B;
        } PGPDI3;               /* Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PJ:16;
                uint32_t PK:11;
                  uint32_t:5;
            } B;
        } PGPDI4;               /* Parallel GPIO Pin Data Input Register */

        int32_t SIU_reserved11[12];

        union {
            uint32_t R;
            struct {
                uint32_t PB_MASK:16;
                uint32_t PB:16;
            } B;
        } MPGPDO1;              /* Masked Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PC_MASK:16;
                uint32_t PC:16;
            } B;
        } MPGPDO2;              /* Masked Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PD_MASK:16;
                uint32_t PD:16;
            } B;
        } MPGPDO3;              /* Masked Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PE_MASK:16;
                uint32_t PE:16;
            } B;
        } MPGPDO4;              /* Masked Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PF_MASK:16;
                uint32_t PF:16;
            } B;
        } MPGPDO5;              /* Masked Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PG_MASK:16;
                uint32_t PG:16;
            } B;
        } MPGPDO6;              /* Masked Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PH_MASK:16;
                uint32_t PH:16;
            } B;
        } MPGPDO7;              /* Masked Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PJ_MASK:16;
                uint32_t PJ:16;
            } B;
        } MPGPDO8;              /* Masked Parallel GPIO Pin Data Input Register */

        union {
            uint32_t R;
            struct {
                uint32_t PK_MASK:11;
                  uint32_t:5;
                uint32_t PK:11;
                  uint32_t:5;
            } B;
        } MPGPDO9;              /* Masked Parallel GPIO Pin Data Input Register */

        int32_t SIU_reserved12[22];

        union {
            uint32_t R;
            struct {
                uint32_t MASK31:1;
                uint32_t MASK30:1;
                uint32_t MASK29:1;
                uint32_t MASK28:1;
                uint32_t MASK27:1;
                uint32_t MASK26:1;
                uint32_t MASK25:1;
                uint32_t MASK24:1;
                uint32_t MASK23:1;
                uint32_t MASK22:1;
                uint32_t MASK21:1;
                uint32_t MASK20:1;
                uint32_t MASK19:1;
                uint32_t MASK18:1;
                uint32_t MASK17:1;
                uint32_t MASK16:1;
                uint32_t DATA31:1;
                uint32_t DATA30:1;
                uint32_t DATA29:1;
                uint32_t DATA28:1;
                uint32_t DATA27:1;
                uint32_t DATA26:1;
                uint32_t DATA25:1;
                uint32_t DATA24:1;
                uint32_t DATA23:1;
                uint32_t DATA22:1;
                uint32_t DATA21:1;
                uint32_t DATA20:1;
                uint32_t DATA19:1;
                uint32_t DATA18:1;
                uint32_t DATA17:1;
                uint32_t DATA16:1;
            } B;
        } DSPIAH;               /* Masked Serial GPO for DSPI_A High Register */

        union {
            uint32_t R;
            struct {
                uint32_t MASK15:1;
                uint32_t MASK14:1;
                uint32_t MASK13:1;
                uint32_t MASK12:1;
                uint32_t MASK11:1;
                uint32_t MASK10:1;
                uint32_t MASK9:1;
                uint32_t MASK8:1;
                uint32_t MASK7:1;
                uint32_t MASK6:1;
                uint32_t MASK5:1;
                uint32_t MASK4:1;
                uint32_t MASK3:1;
                uint32_t MASK2:1;
                uint32_t MASK1:1;
                uint32_t MASK0:1;
                uint32_t DATA15:1;
                uint32_t DATA14:1;
                uint32_t DATA13:1;
                uint32_t DATA12:1;
                uint32_t DATA11:1;
                uint32_t DATA10:1;
                uint32_t DATA9:1;
                uint32_t DATA8:1;
                uint32_t DATA7:1;
                uint32_t DATA6:1;
                uint32_t DATA5:1;
                uint32_t DATA4:1;
                uint32_t DATA3:1;
                uint32_t DATA2:1;
                uint32_t DATA1:1;
                uint32_t DATA0:1;
            } B;
        } DSPIAL;               /* Masked Serial GPO for DSPI_A Low Register */

        union {
            uint32_t R;
            struct {
                uint32_t MASK31:1;
                uint32_t MASK30:1;
                uint32_t MASK29:1;
                uint32_t MASK28:1;
                uint32_t MASK27:1;
                uint32_t MASK26:1;
                uint32_t MASK25:1;
                uint32_t MASK24:1;
                uint32_t MASK23:1;
                uint32_t MASK22:1;
                uint32_t MASK21:1;
                uint32_t MASK20:1;
                uint32_t MASK19:1;
                uint32_t MASK18:1;
                uint32_t MASK17:1;
                uint32_t MASK16:1;
                uint32_t DATA31:1;
                uint32_t DATA30:1;
                uint32_t DATA29:1;
                uint32_t DATA28:1;
                uint32_t DATA27:1;
                uint32_t DATA26:1;
                uint32_t DATA25:1;
                uint32_t DATA24:1;
                uint32_t DATA23:1;
                uint32_t DATA22:1;
                uint32_t DATA21:1;
                uint32_t DATA20:1;
                uint32_t DATA19:1;
                uint32_t DATA18:1;
                uint32_t DATA17:1;
                uint32_t DATA16:1;
            } B;
        } DSPIBH;               /* Masked Serial GPO for DSPI_B High Register */

        union {
            uint32_t R;
            struct {
                uint32_t MASK15:1;
                uint32_t MASK14:1;
                uint32_t MASK13:1;
                uint32_t MASK12:1;
                uint32_t MASK11:1;
                uint32_t MASK10:1;
                uint32_t MASK9:1;
                uint32_t MASK8:1;
                uint32_t MASK7:1;
                uint32_t MASK6:1;
                uint32_t MASK5:1;
                uint32_t MASK4:1;
                uint32_t MASK3:1;
                uint32_t MASK2:1;
                uint32_t MASK1:1;
                uint32_t MASK0:1;
                uint32_t DATA15:1;
                uint32_t DATA14:1;
                uint32_t DATA13:1;
                uint32_t DATA12:1;
                uint32_t DATA11:1;
                uint32_t DATA10:1;
                uint32_t DATA9:1;
                uint32_t DATA8:1;
                uint32_t DATA7:1;
                uint32_t DATA6:1;
                uint32_t DATA5:1;
                uint32_t DATA4:1;
                uint32_t DATA3:1;
                uint32_t DATA2:1;
                uint32_t DATA1:1;
                uint32_t DATA0:1;
            } B;
        } DSPIBL;               /* Masked Serial GPO for DSPI_B Low Register */

        union {
            uint32_t R;
            struct {
                uint32_t MASK31:1;
                uint32_t MASK30:1;
                uint32_t MASK29:1;
                uint32_t MASK28:1;
                uint32_t MASK27:1;
                uint32_t MASK26:1;
                uint32_t MASK25:1;
                uint32_t MASK24:1;
                uint32_t MASK23:1;
                uint32_t MASK22:1;
                uint32_t MASK21:1;
                uint32_t MASK20:1;
                uint32_t MASK19:1;
                uint32_t MASK18:1;
                uint32_t MASK17:1;
                uint32_t MASK16:1;
                uint32_t DATA31:1;
                uint32_t DATA30:1;
                uint32_t DATA29:1;
                uint32_t DATA28:1;
                uint32_t DATA27:1;
                uint32_t DATA26:1;
                uint32_t DATA25:1;
                uint32_t DATA24:1;
                uint32_t DATA23:1;
                uint32_t DATA22:1;
                uint32_t DATA21:1;
                uint32_t DATA20:1;
                uint32_t DATA19:1;
                uint32_t DATA18:1;
                uint32_t DATA17:1;
                uint32_t DATA16:1;
            } B;
        } DSPICH;               /* Masked Serial GPO for DSPI_C High Register */

        union {
            uint32_t R;
            struct {
                uint32_t MASK15:1;
                uint32_t MASK14:1;
                uint32_t MASK13:1;
                uint32_t MASK12:1;
                uint32_t MASK11:1;
                uint32_t MASK10:1;
                uint32_t MASK9:1;
                uint32_t MASK8:1;
                uint32_t MASK7:1;
                uint32_t MASK6:1;
                uint32_t MASK5:1;
                uint32_t MASK4:1;
                uint32_t MASK3:1;
                uint32_t MASK2:1;
                uint32_t MASK1:1;
                uint32_t MASK0:1;
                uint32_t DATA15:1;
                uint32_t DATA14:1;
                uint32_t DATA13:1;
                uint32_t DATA12:1;
                uint32_t DATA11:1;
                uint32_t DATA10:1;
                uint32_t DATA9:1;
                uint32_t DATA8:1;
                uint32_t DATA7:1;
                uint32_t DATA6:1;
                uint32_t DATA5:1;
                uint32_t DATA4:1;
                uint32_t DATA3:1;
                uint32_t DATA2:1;
                uint32_t DATA1:1;
                uint32_t DATA0:1;
            } B;
        } DSPICL;               /* Masked Serial GPO for DSPI_C Low Register */

        union {
            uint32_t R;
            struct {
                uint32_t MASK31:1;
                uint32_t MASK30:1;
                uint32_t MASK29:1;
                uint32_t MASK28:1;
                uint32_t MASK27:1;
                uint32_t MASK26:1;
                uint32_t MASK25:1;
                uint32_t MASK24:1;
                uint32_t MASK23:1;
                uint32_t MASK22:1;
                uint32_t MASK21:1;
                uint32_t MASK20:1;
                uint32_t MASK19:1;
                uint32_t MASK18:1;
                uint32_t MASK17:1;
                uint32_t MASK16:1;
                uint32_t DATA31:1;
                uint32_t DATA30:1;
                uint32_t DATA29:1;
                uint32_t DATA28:1;
                uint32_t DATA27:1;
                uint32_t DATA26:1;
                uint32_t DATA25:1;
                uint32_t DATA24:1;
                uint32_t DATA23:1;
                uint32_t DATA22:1;
                uint32_t DATA21:1;
                uint32_t DATA20:1;
                uint32_t DATA19:1;
                uint32_t DATA18:1;
                uint32_t DATA17:1;
                uint32_t DATA16:1;
            } B;
        } DSPIDH;               /* Masked Serial GPO for DSPI_D High Register */

        union {
            uint32_t R;
            struct {
                uint32_t MASK15:1;
                uint32_t MASK14:1;
                uint32_t MASK13:1;
                uint32_t MASK12:1;
                uint32_t MASK11:1;
                uint32_t MASK10:1;
                uint32_t MASK9:1;
                uint32_t MASK8:1;
                uint32_t MASK7:1;
                uint32_t MASK6:1;
                uint32_t MASK5:1;
                uint32_t MASK4:1;
                uint32_t MASK3:1;
                uint32_t MASK2:1;
                uint32_t MASK1:1;
                uint32_t MASK0:1;
                uint32_t DATA15:1;
                uint32_t DATA14:1;
                uint32_t DATA13:1;
                uint32_t DATA12:1;
                uint32_t DATA11:1;
                uint32_t DATA10:1;
                uint32_t DATA9:1;
                uint32_t DATA8:1;
                uint32_t DATA7:1;
                uint32_t DATA6:1;
                uint32_t DATA5:1;
                uint32_t DATA4:1;
                uint32_t DATA3:1;
                uint32_t DATA2:1;
                uint32_t DATA1:1;
                uint32_t DATA0:1;
            } B;
        } DSPIDL;               /* Masked Serial GPO for DSPI_D Low Register */

        int32_t SIU_reserved13[9];

