RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
        union {
            uint32_t R;
            struct {
                uint32_t EMIOS31:1;
                uint32_t EMIOS30:1;
                uint32_t EMIOS29:1;
                uint32_t EMIOS28:1;
                uint32_t EMIOS27:1;
                uint32_t EMIOS26:1;
                uint32_t EMIOS25:1;
                uint32_t EMIOS24:1;
                uint32_t EMIOS23:1;
                uint32_t EMIOS22:1;
                uint32_t EMIOS21:1;
                uint32_t EMIOS20:1;
                uint32_t EMIOS19:1;
                uint32_t EMIOS18:1;
                uint32_t EMIOS17:1;
                uint32_t EMIOS16:1;
                uint32_t EMIOS15:1;
                uint32_t EMIOS14:1;
                uint32_t EMIOS13:1;
                uint32_t EMIOS12:1;
                uint32_t EMIOS11:1;
                uint32_t EMIOS10:1;
                uint32_t EMIOS9:1;
                uint32_t EMIOS8:1;
                uint32_t EMIOS7:1;
                uint32_t EMIOS6:1;
                uint32_t EMIOS5:1;
                uint32_t EMIOS4:1;
                uint32_t EMIOS3:1;
                uint32_t EMIOS2:1;
                uint32_t EMIOS1:1;
                uint32_t EMIOS0:1;
            } B;
        } EMIOSA;               /* EMIOS A Select Register */

        union {
            uint32_t R;
            struct {
                uint32_t DSPIAH31:1;
                uint32_t DSPIAH30:1;
                uint32_t DSPIAH29:1;
                uint32_t DSPIAH28:1;
                uint32_t DSPIAH27:1;
                uint32_t DSPIAH26:1;
                uint32_t DSPIAH25:1;
                uint32_t DSPIAH24:1;
                uint32_t DSPIAH23:1;
                uint32_t DSPIAH22:1;
                uint32_t DSPIAH21:1;
                uint32_t DSPIAH20:1;
                uint32_t DSPIAH19:1;
                uint32_t DSPIAH18:1;
                uint32_t DSPIAH17:1;
                uint32_t DSPIAH16:1;
                uint32_t DSPIAL15:1;
                uint32_t DSPIAL14:1;
                uint32_t DSPIAL13:1;
                uint32_t DSPIAL12:1;
                uint32_t DSPIAL11:1;
                uint32_t DSPIAL10:1;
                uint32_t DSPIAL9:1;
                uint32_t DSPIAL8:1;
                uint32_t DSPIAL7:1;
                uint32_t DSPIAL6:1;
                uint32_t DSPIAL5:1;
                uint32_t DSPIAL4:1;
                uint32_t DSPIAL3:1;
                uint32_t DSPIAL2:1;
                uint32_t DSPIAL1:1;
                uint32_t DSPIAL0:1;
            } B;
        } DSPIAHLA;             /* DSPIAH/L Select Register for DSPI A */

        int32_t SIU_reserved14[2];

        union {
            uint32_t R;
            struct {
                uint32_t EMIOS31:1;
                uint32_t EMIOS30:1;
                uint32_t EMIOS29:1;
                uint32_t EMIOS28:1;
                uint32_t EMIOS27:1;
                uint32_t EMIOS26:1;
                uint32_t EMIOS25:1;
                uint32_t EMIOS24:1;
                uint32_t EMIOS23:1;
                uint32_t EMIOS22:1;
                uint32_t EMIOS21:1;
                uint32_t EMIOS20:1;
                uint32_t EMIOS19:1;
                uint32_t EMIOS18:1;
                uint32_t EMIOS17:1;
                uint32_t EMIOS16:1;
                uint32_t EMIOS15:1;
                uint32_t EMIOS14:1;
                uint32_t EMIOS13:1;
                uint32_t EMIOS12:1;
                uint32_t EMIOS11:1;
                uint32_t EMIOS10:1;
                uint32_t EMIOS9:1;
                uint32_t EMIOS8:1;
                uint32_t EMIOS7:1;
                uint32_t EMIOS6:1;
                uint32_t EMIOS5:1;
                uint32_t EMIOS4:1;
                uint32_t EMIOS3:1;
                uint32_t EMIOS2:1;
                uint32_t EMIOS1:1;
                uint32_t EMIOS0:1;
            } B;
        } EMIOSB;               /* EMIOS B Select Register */

        union {
            uint32_t R;
            struct {
                uint32_t DSPIBH31:1;
                uint32_t DSPIBH30:1;
                uint32_t DSPIBH29:1;
                uint32_t DSPIBH28:1;
                uint32_t DSPIBH27:1;
                uint32_t DSPIBH26:1;
                uint32_t DSPIBH25:1;
                uint32_t DSPIBH24:1;
                uint32_t DSPIBH23:1;
                uint32_t DSPIBH22:1;
                uint32_t DSPIBH21:1;
                uint32_t DSPIBH20:1;
                uint32_t DSPIBH19:1;
                uint32_t DSPIBH18:1;
                uint32_t DSPIBH17:1;
                uint32_t DSPIBH16:1;
                uint32_t DSPIBL15:1;
                uint32_t DSPIBL14:1;
                uint32_t DSPIBL13:1;
                uint32_t DSPIBL12:1;
                uint32_t DSPIBL11:1;
                uint32_t DSPIBL10:1;
                uint32_t DSPIBL9:1;
                uint32_t DSPIBL8:1;
                uint32_t DSPIBL7:1;
                uint32_t DSPIBL6:1;
                uint32_t DSPIBL5:1;
                uint32_t DSPIBL4:1;
                uint32_t DSPIBL3:1;
                uint32_t DSPIBL2:1;
                uint32_t DSPIBL1:1;
                uint32_t DSPIBL0:1;
            } B;
        } DSPIBHLB;             /* DSPIBH/L Select Register for DSPI B */

        int32_t SIU_reserved115[2];

        union {
            uint32_t R;
            struct {
                uint32_t EMIOS31:1;
                uint32_t EMIOS30:1;
                uint32_t EMIOS29:1;
                uint32_t EMIOS28:1;
                uint32_t EMIOS27:1;
                uint32_t EMIOS26:1;
                uint32_t EMIOS25:1;
                uint32_t EMIOS24:1;
                uint32_t EMIOS23:1;
                uint32_t EMIOS22:1;
                uint32_t EMIOS21:1;
                uint32_t EMIOS20:1;
                uint32_t EMIOS19:1;
                uint32_t EMIOS18:1;
                uint32_t EMIOS17:1;
                uint32_t EMIOS16:1;
                uint32_t EMIOS15:1;
                uint32_t EMIOS14:1;
                uint32_t EMIOS13:1;
                uint32_t EMIOS12:1;
                uint32_t EMIOS11:1;
                uint32_t EMIOS10:1;
                uint32_t EMIOS9:1;
                uint32_t EMIOS8:1;
                uint32_t EMIOS7:1;
                uint32_t EMIOS6:1;
                uint32_t EMIOS5:1;
                uint32_t EMIOS4:1;
                uint32_t EMIOS3:1;
                uint32_t EMIOS2:1;
                uint32_t EMIOS1:1;
                uint32_t EMIOS0:1;
            } B;
        } EMIOSC;               /* EMIOS C Select Register */

        union {
            uint32_t R;
            struct {
                uint32_t DSPICH31:1;
                uint32_t DSPICH30:1;
                uint32_t DSPICH29:1;
                uint32_t DSPICH28:1;
                uint32_t DSPICH27:1;
                uint32_t DSPICH26:1;
                uint32_t DSPICH25:1;
                uint32_t DSPICH24:1;
                uint32_t DSPICH23:1;
                uint32_t DSPICH22:1;
                uint32_t DSPICH21:1;
                uint32_t DSPICH20:1;
                uint32_t DSPICH19:1;
                uint32_t DSPICH18:1;
                uint32_t DSPICH17:1;
                uint32_t DSPICH16:1;
                uint32_t DSPICL15:1;
                uint32_t DSPICL14:1;
                uint32_t DSPICL13:1;
                uint32_t DSPICL12:1;
                uint32_t DSPICL11:1;
                uint32_t DSPICL10:1;
                uint32_t DSPICL9:1;
                uint32_t DSPICL8:1;
                uint32_t DSPICL7:1;
                uint32_t DSPICL6:1;
                uint32_t DSPICL5:1;
                uint32_t DSPICL4:1;
                uint32_t DSPICL3:1;
                uint32_t DSPICL2:1;
                uint32_t DSPICL1:1;
                uint32_t DSPICL0:1;
            } B;
        } DSPICHLC;             /* DSPIAH/L Select Register for DSPI C */

        int32_t SIU_reserved16[2];

        union {
            uint32_t R;
            struct {
                uint32_t EMIOS31:1;
                uint32_t EMIOS30:1;
                uint32_t EMIOS29:1;
                uint32_t EMIOS28:1;
                uint32_t EMIOS27:1;
                uint32_t EMIOS26:1;
                uint32_t EMIOS25:1;
                uint32_t EMIOS24:1;
                uint32_t EMIOS23:1;
                uint32_t EMIOS22:1;
                uint32_t EMIOS21:1;
                uint32_t EMIOS20:1;
                uint32_t EMIOS19:1;
                uint32_t EMIOS18:1;
                uint32_t EMIOS17:1;
                uint32_t EMIOS16:1;
                uint32_t EMIOS15:1;
                uint32_t EMIOS14:1;
                uint32_t EMIOS13:1;
                uint32_t EMIOS12:1;
                uint32_t EMIOS11:1;
                uint32_t EMIOS10:1;
                uint32_t EMIOS9:1;
                uint32_t EMIOS8:1;
                uint32_t EMIOS7:1;
                uint32_t EMIOS6:1;
                uint32_t EMIOS5:1;
                uint32_t EMIOS4:1;
                uint32_t EMIOS3:1;
                uint32_t EMIOS2:1;
                uint32_t EMIOS1:1;
                uint32_t EMIOS0:1;
            } B;
        } EMIOSD;               /* EMIOS D Select Register */

        union {
            uint32_t R;
            struct {
                uint32_t DSPIDH31:1;
                uint32_t DSPIDH30:1;
                uint32_t DSPIDH29:1;
                uint32_t DSPIDH28:1;
                uint32_t DSPIDH27:1;
                uint32_t DSPIDH26:1;
                uint32_t DSPIDH25:1;
                uint32_t DSPIDH24:1;
                uint32_t DSPIDH23:1;
                uint32_t DSPIDH22:1;
                uint32_t DSPIDH21:1;
                uint32_t DSPIDH20:1;
                uint32_t DSPIDH19:1;
                uint32_t DSPIDH18:1;
                uint32_t DSPIDH17:1;
                uint32_t DSPIDH16:1;
                uint32_t DSPIDL15:1;
                uint32_t DSPIDL14:1;
                uint32_t DSPIDL13:1;
                uint32_t DSPIDL12:1;
                uint32_t DSPIDL11:1;
                uint32_t DSPIDL10:1;
                uint32_t DSPIDL9:1;
                uint32_t DSPIDL8:1;
                uint32_t DSPIDL7:1;
                uint32_t DSPIDL6:1;
                uint32_t DSPIDL5:1;
                uint32_t DSPIDL4:1;
                uint32_t DSPIDL3:1;
                uint32_t DSPIDL2:1;
                uint32_t DSPIDL1:1;
                uint32_t DSPIDL0:1;
            } B;
        } DSPIDHLD;             /* DSPIAH/L Select Register for DSPI D */

    };                          /* end of SIU_tag */
/**************************************************************************/
/*                          MODULE : STM                                  */
/**************************************************************************/
    struct STM_tag {

        union {
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t CPS:8;
                  uint32_t:6;
                uint32_t FRZ:1;
                uint32_t TEN:1;
            } B;
        } CR;                   /* STM Control Register */

        union {
            uint32_t R;
        } CNT;                  /* STM Count Register */

        int32_t STM_reserved[2];

        union {
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t CEN:1;
            } B;
        } CCR0;                 /* STM Channel Control Register 0 */

        union {
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t CIF:1;
            } B;
        } CIR0;                 /* STM Channel Interrupt Register 0 */

        union {
            uint32_t R;
        } CMP0;                 /* STM Channel Compare Register 0 */

