RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc5668.h
        int32_t STM_reserved1;

        union {
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t CEN:1;
            } B;
        } CCR1;                 /* STM Channel Control Register 1 */

        union {
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t CIF:1;
            } B;
        } CIR1;                 /* STM Channel Interrupt Register 1 */

        union {
            uint32_t R;
        } CMP1;                 /* STM Channel Compare Register 1 */

        int32_t STM_reserved2;

        union {
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t CEN:1;
            } B;
        } CCR2;                 /* STM Channel Control Register 2 */

        union {
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t CIF:1;
            } B;
        } CIR2;                 /* STM Channel Interrupt Register 2 */

        union {
            uint32_t R;
        } CMP2;                 /* STM Channel Compare Register 2 */

        int32_t STM_reserved3;

        union {
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t CEN:1;
            } B;
        } CCR3;                 /* STM Channel Control Register 3 */

        union {
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t CIF:1;
            } B;
        } CIR3;                 /* STM Channel Interrupt Register 3 */

        union {
            uint32_t R;
        } CMP3;                 /* STM Channel Compare Register 3 */

    };                          /* end of STM_tag */
/**************************************************************************/
/*                          MODULE : SWT                                  */
/**************************************************************************/
    struct SWT_tag {
        union {
            uint32_t R;
            struct {
                uint32_t MAP0:1;
                uint32_t MAP1:1;
                uint32_t MAP2:1;
                uint32_t MAP3:1;
                uint32_t MAP4:1;
                uint32_t MAP5:1;
                uint32_t MAP6:1;
                uint32_t MAP7:1;
                  uint32_t:14;
                uint32_t KEY:1;
                uint32_t RIA:1;
                uint32_t WND:1;
                uint32_t ITR:1;
                uint32_t HLK:1;
                uint32_t SLK:1;
                  uint32_t:2;
                uint32_t FRZ:1;
                uint32_t WEN:1;
            } B;
        } CR;                   /* SWT Control Register */

        union {
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t TIF:1;
            } B;
        } IR;                   /* SWT Interrupt Register */

        union {
            uint32_t R;
            struct {
                uint32_t WTO:32;
            } B;
        } TO;                   /* SWT Time-Out Register */

        union {
            uint32_t R;
            struct {
                uint32_t WST:32;
            } B;
        } WN;                   /* SWT Window Register */

        union {
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t WSC:16;
            } B;
        } SR;                   /* SWT Service Register */

        union {
            uint32_t R;
            struct {
                uint32_t CNT:32;
            } B;
        } CO;                   /* SWT Counter Output Register */

        union {
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t SK:16;
            } B;
        } SK;                   /* SWT Service Key Register */

    };                          /* end of SWT_tag */

/* Define memories */

#define SRAM0_START   0x40000000UL
#define SRAM0_SIZE       0x80000UL
#define SRAM0_END     0x4007FFFFUL

#define SRAM1_START   0x40080000UL
#define SRAM1_SIZE       0x14000UL
#define SRAM1_END     0x40093FFFUL

#define FLASH_START         0x0UL
#define FLASH_SIZE     0x200000UL
#define FLASH_END      0x1FFFFFUL

/* Define instances of modules AIPS_A */
#define MLB       (*(volatile struct MLB_tag *)       0xC3F84000UL)
#define I2C_C     (*(volatile struct I2C_tag *)       0xC3F88000UL)
#define I2C_D     (*(volatile struct I2C_tag *)       0xC3F8C000UL)
#define DSPI_C    (*(volatile struct DSPI_tag *)      0xC3F90000UL)
#define DSPI_D    (*(volatile struct DSPI_tag *)      0xC3F94000UL)
#define ESCI_J    (*(volatile struct ESCI_tag *)      0xC3FA0000UL)
#define ESCI_K    (*(volatile struct ESCI_tag *)      0xC3FA4000UL)
#define ESCI_L    (*(volatile struct ESCI_tag *)      0xC3FA8000UL)
#define ESCI_M    (*(volatile struct ESCI_tag *)      0xC3FAC000UL)
#define FR        (*(volatile struct FR_tag *)        0xC3FDC000UL)

/* Define instances of modules AIPS_B */
#define XBAR      (*(volatile struct XBAR_tag *)      0xFFF04000UL)
#define SEMA4     (*(volatile struct SEMA4_tag *)     0xFFF10000UL)
#define MPU       (*(volatile struct MPU_tag *)       0xFFF14000UL)
#define SWT       (*(volatile struct SWT_tag *)       0xFFF38000UL)
#define STM       (*(volatile struct STM_tag *)       0xFFF3C000UL)
#define ECSM      (*(volatile struct ECSM_tag *)      0xFFF40000UL)
#define EDMA      (*(volatile struct EDMA_tag *)      0xFFF44000UL)
#define INTC      (*(volatile struct INTC_tag *)      0xFFF48000UL)
#define FEC       (*(volatile struct FEC_tag *)       0xFFF4C000UL)
#define ADC       (*(volatile struct ADC_tag *)       0xFFF80000UL)
#define I2C_A     (*(volatile struct I2C_tag *)       0xFFF88000UL)
#define I2C_B     (*(volatile struct I2C_tag *)       0xFFF8C000UL)
#define DSPI_A    (*(volatile struct DSPI_tag *)      0xFFF90000UL)
#define DSPI_B    (*(volatile struct DSPI_tag *)      0xFFF94000UL)
#define ESCI_A    (*(volatile struct ESCI_tag *)      0xFFFA0000UL)
#define ESCI_B    (*(volatile struct ESCI_tag *)      0xFFFA4000UL)
#define ESCI_C    (*(volatile struct ESCI_tag *)      0xFFFA8000UL)
#define ESCI_D    (*(volatile struct ESCI_tag *)      0xFFFAC000UL)
#define ESCI_E    (*(volatile struct ESCI_tag *)      0xFFFB0000UL)
#define ESCI_F    (*(volatile struct ESCI_tag *)      0xFFFB4000UL)
#define ESCI_G    (*(volatile struct ESCI_tag *)      0xFFFB8000UL)
#define ESCI_H    (*(volatile struct ESCI_tag *)      0xFFFBC000UL)
#define CAN_A     (*(volatile struct FLEXCAN_tag *)   0xFFFC0000UL)
#define CAN_B     (*(volatile struct FLEXCAN_tag *)   0xFFFC4000UL)
#define CAN_C     (*(volatile struct FLEXCAN_tag *)   0xFFFC8000UL)
#define CAN_D     (*(volatile struct FLEXCAN_tag *)   0xFFFCC000UL)
#define CAN_E     (*(volatile struct FLEXCAN_tag *)   0xFFFD0000UL)
#define CAN_F     (*(volatile struct FLEXCAN_tag *)   0xFFFD4000UL)
#define CTU       (*(volatile struct CTU_tag *)       0xFFFD8000UL)
#define DMAMUX    (*(volatile struct DMAMUX_tag *)    0xFFFDC000UL)
#define PIT       (*(volatile struct PIT_tag *)       0xFFFE0000UL)
#define PIT_RTI   (*(volatile struct PIT_tag *)       0xFFFE0000UL)
#define EMIOS     (*(volatile struct EMIOS_tag *)     0xFFFE4000UL)
#define SIU       (*(volatile struct SIU_tag *)       0xFFFE8000UL)
#define CRP       (*(volatile struct CRP_tag *)       0xFFFEC000UL)
#define FMPLL     (*(volatile struct FMPLL_tag *)     0xFFFF0000UL)
#define FLASH     (*(volatile struct FLASH_tag *)     0xFFFF8000UL)

#ifdef __MWERKS__
#pragma pop
#endif

#ifdef  __cplusplus
}
#endif
#endif /* ASM */
#endif                          /* ifdef _MPC5668_H */
